{
	"commands": {
		"descriptions": {
			"verify": "Starts a verification process or let's you manage your current verifications on this server.",
			"verify-add": "Starts a transaction-based verification of a staking address",
			"verify-help": "Get help about the verification features",
			"verify-link": "Link your verified addresses to this Discord server to enable additional features",
			"verify-list": "List all staking addresses and link status associated with this Discord user and server",
			"verify-remove": "Removes a verified wallet address",
			"verify-unlink": "Unlink your verified addresses from this server (verifications will remain)",
			"whois": "Find out info about an ADA Handle or address.",
			"policyid": "Lists all policy IDs and projects associated with this server.",
			"info": "Shows info and stakepools for this server.",
			"whitelist": "View and register for whitelist events in this Discord.",
			"whitelist-register": "Register for a whitelist",
			"whitelist-list": "Show all whitelists and requirements for each whitelist.",
			"whitelist-unregister": "Remove yourself from a whitelist",
			"help": "Show general help on how to use this bot.",
			"vote": "View the list of open polls and vote, if you are eligible.",
			"claim": "Claim virtual or physical goods you are eligible for.",
			"premium": "Manage your premium account and check your claimable **$HAZEL** balance and other perks.",
			"profile": "See and change your profile settings.",
			"profile-toggle": "Toggle one of your on/off style profile settings.",
			"profile-defaulthandle": "Set the default ADA Handle linked to your account.",
			"ping": "Get in touch with an unknown user via $handle or NFT asset fingerprint.",
			"ping-send": "Send a ping to an unknown party.",
			"ping-list": "List recent sent and received pings.",
			"configure-info": "Helpful widgets and features to keep your community informed.",
			"configure-info-epochclock": "A Cardano Epoch Clock right in your Discord.",
			"configure-info-rolecounter": "A counter for a specific role, showing in your Discord.",
			"configure-bans": "Configure bans for Discord users, wallets and assets",
			"configure-bans-add": "Add a new ban to your server",
			"configure-bans-list": "List all bans active on your server",
			"configure-bans-details": "Get detailed information about a ban",
			"configure-bans-remove": "Remove a ban from your server",
			"configure-protection": "Configuration options around scammer protection",
			"configure-protection-status": "Show the status of all protection-related mechanisms.",
			"configure-protection-addressremove": "Turn on/off autoremoval of messages that contain an address/handle to protect from scammers.",
			"configure-protection-auditchannel": "Dedicate a channel for all messages that are related to warnings/auditing.",
			"configure-verify": "Configure the verification process and requirements and see verification info.",
			"configure-verify-info": "Show some basic statistics about your communities verification status.",
			"configure-verify-announce": "Announce the verification process and create a verification widget.",
			"configure-settings": "General configuration options for the bot",
			"configure-settings-features": "Turn features of the bot on and off for the whole server.",
			"configure-settings-customize": "Customize the bot and style it with your own branding.",
			"configure-poll": "Manage polls for people to vote on (off-chain)",
			"configure-poll-list": "List all polls that are set up on this Discord server.",
			"configure-poll-add": "Adds a new poll to the server. You will be able to determine voting conditions and visibility.",
			"configure-poll-add-onchain": "Registers a new Voteaire onchain vote with the bot for users to discover and vote on.",
			"configure-poll-announce": "Announce the current results of a poll to the channel this command is run in.",
			"configure-poll-remove": "Select and remove an existing poll. ⚠ This will also remove all votes and previous results.",
			"configure-poll-update": "Change advanced options on your existing poll.",
			"configure-poll-update-addrole": "Adds a new eligible role that can vote to an existing poll.",
			"configure-poll-update-removerole": "Removes a currently eligible role from an existing poll.",
			"configure-giveaway": "Manage giveaways for people to participate in",
			"configure-giveaway-list": "List all giveaways that are set up on this Discord server.",
			"configure-giveaway-add": "Adds a new giveaway to the server. You will be able to determine conditions.",
			"configure-giveaway-announce": "Create a participation widget for a giveaway.",
			"configure-giveaway-end": "Draw the winner for an existing giveaway.",
			"configure-giveaway-remove": "Select and remove an existing giveaway. ⚠ This will also remove all participants and winners.",
			"configure-giveaway-update": "Change advanced options on your existing giveaway.",
			"configure-giveaway-update-addrole": "Adds a new eligible role that can participate in an existing giveaway.",
			"configure-giveaway-update-removerole": "Removes a currently eligible role from an existing giveaway.",
			"configure-quiz": "Manage quizzes for people to participate in",
			"configure-quiz-list": "List all quizs that are set up on this Discord server.",
			"configure-quiz-add": "Adds a new quiz to the server. You will be able to determine conditions.",
			"configure-quiz-announce": "Create a participation widget for a quiz.",
			"configure-quiz-end": "Draw the winner(s) for an existing quiz.",
			"configure-quiz-remove": "Select and remove an existing quiz. ⚠ This will also remove all participants and winners.",
			"configure-quiz-update": "Change advanced options on your existing quiz.",
			"configure-quiz-update-addrole": "Adds a new eligible role that can participate in an existing quiz.",
			"configure-quiz-update-removerole": "Removes a currently eligible role from an existing quiz.",
			"configure-quiz-update-addquestion": "Adds a new question/answer combination to an existing quiz.",
			"configure-quiz-update-removequestion": "Removes a question/answer combination from an existing quiz.",
			"configure-whitelist": "Manage whitelists for people to submit addresses for",
			"configure-whitelist-add": "Adds a new whitelist that people on this Discord can sign up for, depending on if they meet the required criteria.",
			"configure-whitelist-list": "List all whitelists that are defined on this Discord server.",
			"configure-whitelist-close": "Temporarily or permanently close a whitelist for registrations.",
			"configure-whitelist-open": "Reopen a closed whitelist for registrations.",
			"configure-whitelist-update": "Update an existing whitelist",
			"configure-whitelist-update-details": "Update settings for an existing whitelist",
			"configure-whitelist-update-addrole": "Adds a new eligible role that can register for a whitelist.",
			"configure-whitelist-update-removerole": "Removes a currently eligible role from a whitelist.",
			"configure-whitelist-announce": "Announce your whitelist in a channel and create an interactive signup widget.",
			"configure-whitelist-share": "Share your whitelist data with another HAZELnet Discord.",
			"configure-whitelist-unshare": "Turn off whitelist sharing for this whitelist.",
			"configure-whitelist-download": "Download the signups for a specific whitelist.",
			"configure-whitelist-remove": "Select and remove an existing whitelist. ⚠ This will also remove all registrations.",
			"configure-premium": "Set up and get info about your Black Edition Premium status.",
			"configure-premium-status": "See your premium status and wallet balance, as well as delegation discounts for Black Edition usage.",
			"configure-premium-refill": "Start a payment process to refill or top off your balance.",
			"configure-tokenroles": "Manage auto-role assignments for NFT and other token-holders",
			"configure-tokenroles-add": "Adds an auto-assignment for the given role based on NFTs and FTs in a users verified wallets.",
			"configure-tokenroles-update": "Updates an existing token role assignment with new configuration options.",
			"configure-tokenroles-list": "List all roles that will auto-assigned to verified holders of NFTs and FTs of configured policy IDs",
			"configure-tokenroles-details": "Get details on the specific token role assignment",
			"configure-tokenroles-metadatafilter": "Manage metadata filters on your token roles.",
			"configure-tokenroles-metadatafilter-add": "Adds a metadata filter to your existing token role.",
			"configure-tokenroles-metadatafilter-remove": "Remove a metadata filter from your existing token role.",
			"configure-tokenroles-policies": "Manage policies on your token roles.",
			"configure-tokenroles-policies-add": "Adds an accepted policy to your existing token role.",
			"configure-tokenroles-policies-remove": "Remove an accepted policy from your existing token role.",
			"configure-tokenroles-remove": "Remove the auto-assignment for the given role for NFT and FT holders.",
			"configure-tokenroles-test": "Test what token roles a user is currently eligible for.",
			"configure-delegatorroles": "Configure delegator-roles",
			"configure-delegatorroles-add": "Adds an auto-assignment for the given role.",
			"configure-delegatorroles-list": "List all auto-assigned roles for delegators of the pools configured for this server.",
			"configure-delegatorroles-remove": "Remove all auto-assignments (for all stake amounts) for the given role for delegators.",
			"configure-delegatorroles-test": "Test what delegator roles a user is currently eligible for.",
			"configure-stakepool": "Configure stakepools",
			"configure-stakepool-add": "Add a Cardano stakepool ID for which this Discord server is assigning auto-roles.",
			"configure-stakepool-list": "List all Cardano stakepool IDs for which this Discord server is assigning auto-roles for delegators.",
			"configure-stakepool-remove": "Remove the Cardano stakepool ID from the list of pools this server is configured for.",
			"configure-policy": "Manage asset policies that are officially represented by this server",
			"configure-policy-add": "Add a Cardano policy ID and associated project name to the list of official projects on this server.",
			"configure-policy-list": "List all Cardano policy IDs configured as official policies for projects on this server.",
			"configure-policy-remove": "Remove the Cardano policy ID from this server's official policy list.",
			"configure-policy-announce": "Announce all your official policies and associated project names.",
			"configure-policy-mintcounter": "Track your current mint count in your Discord channel.",
			"configure-healthcheck": "Run a basic health check on your bot to find and correct common problems.",
			"configure-marketplace": "Configure marketplace integrations.",
			"configure-marketplace-sales": "Configure your sales trackers.",
			"configure-marketplace-sales-add": "Add a sales tracker one of your Discord channels.",
			"configure-marketplace-sales-list": "Show all your configured sales trackers.",
			"configure-marketplace-sales-remove": "Remove an existing sales tracker.",
			"configure-marketplace-mint": "Configure your mint trackers.",
			"configure-marketplace-mint-add": "Add a mint tracker one of your Discord channels.",
			"configure-marketplace-mint-list": "Show all your configured mint trackers.",
			"configure-marketplace-mint-remove": "Remove an existing mint tracker.",
			"configure-marketplace-listings": "Configure your listing trackers.",
			"configure-marketplace-listings-add": "Add a listing tracker one of your Discord channels.",
			"configure-marketplace-listings-list": "Show all your configured listing trackers.",
			"configure-marketplace-listings-remove": "Remove an existing listing tracker.",
			"configure-marketplace-metadatafilter": "Manage metadata filters on your trackers.",
			"configure-marketplace-metadatafilter-add": "Adds a metadata filter to your existing tracker.",
			"configure-marketplace-metadatafilter-remove": "Remove a metadata filter from your existing tracker.",
			"configure-api": "Manage your access token to connect to the public API of HAZELnet",
			"configure-api-generatetoken": "Generates a new token to access the API. ⚠ This will overwrite any existing token, if present.",
			"configure-api-removetoken": "Delete the current access token, revoking all access to the public API of HAZELnet",
			"configure-adminaccess": "Configure roles that can administer the bot",
			"configure-adminaccess-add": "Adds a role that is allowed to administer the bot.",
			"configure-adminaccess-list": "List all roles that are allowed to administer the bot.",
			"configure-adminaccess-remove": "Remove a role that is currently allowed to administer the bot.",
			"configure-social": "Commands to manage various Discord and social media features and integrations.",
			"configure-social-announce": "Create custom branded announcements.",
			"join": "Join an existing giveaway or raffle.",
			"configure-engagement": "Features to track and increase community engagement",
			"configure-engagement-activityreminder": "Set up a channel for activity reminders",
			"configure-engagement-downloadusers": "Download a file with Discord users in a certain role"
		},
		"options": {
			"verify": {
				"address-or-handle": "Enter the Cardano wallet address or $handle to verify.",
				"address": "Enter the Cardano wallet address to remove from the verified address list."
			},
			"whois": {
				"address-or-handle": "Enter the Cardano wallet address or $handle to get information on."
			},
			"profile": {
				"option": "The configuration option to change.",
				"handle": "The ADA Handle to use"
			},
			"ping": {
				"ping-type": "The type of identifier to use for pinging the unknown party.",
				"target": "The exact handle, asset fingerprint or address to ping.",
				"message": "The optional message to send along with the ping."
			},
			"whitelist": {
				"name": "Name of the whitelist",
				"address-or-handle": "The Cardano wallet address or $handle to add register for the whitelist."
			},
			"configure-verify": {
				"channel": "Channel to post the verification widget to.",
				"welcome-text": "A text included in your verification widget to welcome the community.",
				"logo-url": "A URL to a logo to be included in your verification widget."
			},
			"configure-info": {
				"channel": "The channel you want to update with the respective info.",
				"status": "Set to False to turn this feature off.",
				"role": "The role you want to display the count for."
			},
			"configure-bans": {
				"ban-id": "The ID of the ban to remove/update",
				"ban-type": "The type of ban",
				"ban-pattern": "The name/asset/address you want to ban",
				"ban-reason": "commands.options.configure-bans.ban-reason"
			},
			"configure-protection": {
				"status": "Set to False to turn this feature off.",
				"auditchannel": "The channel to send audit/warning messages to."
			},
			"configure-adminaccess": {
				"admin-role": "Role to make an admin/remove as admin on this Discord server."
			},
			"configure-stakepool": {
				"pool-id": "'Pool ID (not ticker) for the pool you want to add/remove"
			},
			"configure-policy": {
				"policy-id": "Policy ID to add/remove as an official token policy on this server",
				"project-name": "The project name to list this policy ID under",
				"channel": "Channel to post the announcement to.",
				"info-text": "A text included in your announcement that contains additional information.",
				"status": "Set to False to turn this feature off.",
				"voice-channel": "Voice channel to update with mint counts",
				"max-count": "The maximum number of tokens that will be minted"
			},
			"configure-delegatorroles": {
				"role": "Role to assign users with the given amount of stake for configured pools.",
				"minimum-stake": "The minimum stake (in ADA) required for this role (0 for any amount).",
				"pool-id": "Pool ID (not ticker) required to be delegating to, or ignore for all pools of this server.",
				"user": "The user to check delegator roles for"
			},
			"configure-poll": {
				"poll-name": "The internal name for this poll (can only be up to 30 alphanumeric characters)",
				"poll-displayname": "The display name for this poll that your users will see",
				"required-role": "Role that is required for a user to have, to be able to vote in this poll",
				"publish-channel": "An optional channel where the announcement and results are published",
				"poll-opentime": "The UTC time after which voting is possible (Format: 2022-01-19T15:00:00Z)",
				"poll-closetime": "The UTC time until which voting is possible (Format: 2022-01-31T15:00:00Z)",
				"channel": "The channel to send the poll announcement and voting widget to.",
				"publishresults": "If you want to publish the results of a non-public poll, pass True for this parameter",
				"ballot-id": "The Voteaire ballot ID you created, with the pattern of \"aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee\"."
			},
			"configure-giveaway": {
				"giveaway-name": "The internal name for this giveaway (can only be up to 30 alphanumeric characters)",
				"giveaway-displayname": "The display name for this giveaway that your users will see",
				"required-role": "Role that is required for a user to have, to be able to participate in this giveaway",
				"giveaway-opentime": "The UTC time after which signup is possible (Format: 2022-01-19T15:00:00Z)",
				"giveaway-closetime": "The UTC time until which signup is possible (Format: 2022-01-31T15:00:00Z)",
				"channel": "The channel to send the giveaway announcement and participation widget to.",
				"winner-count": "The number of winners drawn at the end of the giveaway.",
				"snapshot-time": "The time to take the token snapshot, if this is a token-based giveaway",
				"image-url": "URL to an image to showcase the giveaway"
			},
			"configure-whitelist": {
				"whitelist-name": "The internal name for this whitelist (can only be up to 30 alphanumeric characters)",
				"whitelist-displayname": "The display name for this whitelist (for your users)",
				"type": "The type of whitelist signups you are looking to collect",
				"required-role": "Role that is required for a user to have, to be able to register for this whitelist.",
				"awarded-role": "Role that is assigned to a user automatically if they are signed up for the whitelist.",
				"max-users": "The maximum number of users that can sign up for this whitelist.",
				"signup-start": "An optional UTC time after which registration is possible (Format: 2022-01-19T15:00:00Z)",
				"signup-end": "An optional UTC time until which registration is possible (Format: 2022-01-31T15:00:00Z)",
				"guild-id": "The Discord guild/server ID (Snowflake Format: 717264144759390238)",
				"channel": "The channel to send the whitelist announcement and signup widget to.",
				"logo-url": "A https URL to the image you want to represent your whitelist with",
				"launch-date": "The date on which users can claim their whitelist spot (Format: 2022-01-31T15:00:00Z)"
			},
			"configure-tokenroles": {
				"policy-id": "Policy ID (Does not need to be an official policy of this server)",
				"role": "Role to assign users with the given amount of tokens",
				"count": "Minimum amount of tokens to qualify for this role",
				"max-count": "Maximum amount of tokens to qualify for this role",
				"asset-fingerprint": "Asset fingerprint (useful for multiple FTs under one policy)",
				"token-role-id": "Token role ID to change (get ID from list command)",
				"attribute-path": "Metadata attribute to check (case sensitive!)",
				"operator": "Comparison operator to use",
				"attribute-value": "Value to check for (case sensitive!)",
				"aggregation-type": "The method with which to calculate if someone qualifies for a token role",
				"staking-type": "If set to a staking provider, include staked assets in role assignments",
				"user": "The user to check token roles for",
				"token-weight": "The weight that a token for this filter should carry in the token aggregation formula"
			},
			"configure-marketplace": {
				"policy-id": "Policy ID (Needs to be an official policy of this server)",
				"marketplace": "Marketplace to use (defaults to all available)",
				"minimum-price": "The minimum price for a sale to be considered",
				"channel": "The channel to send tracking announcements to",
				"tracker-id": "The ID of the sales/mint/listings tracker",
				"attribute-path": "Metadata attribute to check (case sensitive!)",
				"operator": "Comparison operator to use",
				"attribute-value": "Value to check for (case sensitive!)",
				"highlight-attribute": "Metadata attribute to highlight in tracker embeds"
			},
			"configure-premium": {
				"refill-amount": "The ADA amount you would like to top off your subscription balance with (2000 ADA or less only)."
			},
			"configure-settings": {
				"element": "The bot UI element to customize",
				"customization-value": "The new style (color, text or image link, depending on the select element)"
			},
			"configure-social": {
				"channel": "Channel to post the announcement to.",
				"title": "The title/headline of your announcement."
			},
			"configure-engagement": {
				"status": "Set to False to turn this feature off.",
				"reminderchannel": "The channel to send public activity reminder messages to.",
				"inactivity-days": "The number of days after which to send an activity reminder.",
				"remindermessage": "A custom reminder message in which you can use the %USER% placeholder.",
				"target-role": "commands.options.configure-engagement.target-role"
			},
			"configure-downloadusers": {
				"target-role": "The role which users need to be in to be included in the list."
			}
		},
		"choices": {
			"ping": {
				"PING_TYPE_HANDLE": "an ADA $handle",
				"PING_TYPE_NFT": "an NFT (via asset fingerprint)",
				"PING_TYPE_ADDRESS": "an ADA wallet address (addr1…) or staking address (stake1…)"
			},
			"configure-bans": {
				"STAKE_ADDRESS_BAN": "Ban a stake address (stake1…)",
				"ASSET_FINGERPRINT_BAN": "Ban an asset (asset1…)"
			},
			"configure-tokenroles": {
				"EQUALS": "equals",
				"NOTEQUALS": "does not equal",
				"CONTAINS": "contains",
				"NOTCONTAINS": "does not contain",
				"STARTSWITH": "starts with",
				"ENDSWITH": "ends with",
				"REGEX": "matches the Regular Expression",
				"ANY_POLICY_FILTERED_AND": "Any policy of the role, each NFT must match all filters",
				"ANY_POLICY_FILTERED_OR": "Any policy of the role, each NFT must match at least one filter",
				"ANY_POLICY_FILTERED_ONE_EACH": "Any policy of the role, each filter must be matched by exactly one unique NFT",
				"EVERY_POLICY_FILTERED_OR": "At least one NFT of each defined policy is required",
				"ANY_POLICY_FILTERED_ALL_MATCHED": "Any policy of the role, all filters must be matched",
				"STAKING_NONE": "No staking",
				"MUTANT_STAKING": "Mutant Staking"
			},
			"configure-settings": {
				"THEME_TOP_LOGO": "Main logo URL",
				"THEME_COLOR_USER": "Embed color",
				"THEME_AUTHOR_NAME": "Author name",
				"THEME_FOOTER_TEXT": "Footer text",
				"THEME_FOOTER_ICON": "Footer icon",
				"THEME_AUTHOR_ICON": "Author icon",
				"INFO_CONTENT_TITLE": "Title for /info command",
				"INFO_CONTENT_TEXT": "Content for /info command",
				"INFO_CONTENT_IMAGE": "Image for /info command",
				"RESET": "Reset all (value must be \"YES\" to confirm)"
			},
			"configure-whitelist": {
				"CARDANO_ADDRESS": "Cardano wallet address (addr1...)",
				"DISCORD_ID": "Discord ID and tag"
			},
			"configure-marketplace": {
				"JPGSTORE": "jpg.store",
				"PLUTUSART": "plutus.art",
				"ALL_MARKETPLACES": "All marketplaces",
				"EQUALS": "equals",
				"NOTEQUALS": "does not equal",
				"CONTAINS": "contains",
				"NOTCONTAINS": "does not contain",
				"STARTSWITH": "starts with",
				"ENDSWITH": "ends with",
				"REGEX": "matches the Regular Expression"
			}
		}
	},
	"info": {
		"welcomeTitle": "Welcome to {{{guildName}}}!",
		"infoBaseText": "The team is happy to have you here!",
		"stakepoolsBaseText": {
			"one": "This server officially supports this Cardano stakepool:",
			"other": "This server officially supports the following Cardano stakepools:"
		},
		"stakepoolDetails": "#️⃣ *Pool hash:*\n{{hash}}\n\nℹ *Description:*\n{{{description}}}\n\n🌍 *Website:*\n{{{website}}}\n\n👁 *Pool.pm:*\nhttps://pool.pm/{{hash}}",
		"stakepoolDetailsShort": "https://pool.pm/{{hash}}"
	},
	"help": {
		"messageTitle": "Get help for {{{botName}}}",
		"messageTitleAdmin": "Help for admin commands of {{{botName}}}",
		"generalCommands": {
			"verify": "The */verify* command and its subcommands let you verify your own Cardano address and will enable features like automatic role-assignments based on delegation and token roles.\n**Important:** 💡 The admins of this Discord will *not* be able to see any of your verified addresses. They can only see addresses that you register for a whitelist! Your security always comes first.",
			"verify-add": "With */verify add* you can add a new address to your list of verified wallets. Issuing the command will ask you to send a specific amount of ADA to yourself within a specific amount of time. If the transaction is confirmed this verifies your wallet and allows the system to also verify token and NFT ownership. A wallet can only be registered with one Discord user at one time.\n❕ You can also provide a handle for verification - it will automatically be resolved into an address.\n💡 Verifying a wallet will link the Discord server on which you are performing the verification as part of the process, so no explicit */verify link* is needed.",
			"verify-help": "This command, which will print out information on how to use the */verify* feature.",
			"verify-link": "When you first join a server, all your verified addresses will not be linked by default. This means your privacy comes first and you will not be assigned any roles without authorizing it via */verify link*. This command will enable this bot to assign automatic roles and use other features on this specific Discord server for your account.",
			"verify-list": "When using */verify list*, all your open and confirmed verifications will be listed. If you ever get disconnected during a verification process, you can retrieve the info needed to verify here. This command also lets you cancel your open verification, if needed.",
			"verify-remove": "If you want to remove a verified address from your account, simply use */verify remove* and the wallet will not be used for any token roles or other features on any of your link Discord servers any more.",
			"verify-unlink": "If you would like to unlink a wallet from a specific Discord server, because you wish to not receive automatic role-assignments or other treatment that might reveal anything about you, use the */verify unlink* command.",
			"help": "Shows this help text.",
			"profile": "Change your profile information and account settings.",
			"vote": "Participate in a poll on this Discord server.",
			"ping": "Ping the owner of an NFT, address or staking address via a private message, without knowing their name.",
			"premium": "See your premium status and $HAZEL balance, as well as pledge your stake to your Discord server."
		},
		"stakepoolCommands": {
			"info": "The */info* command gives you some basic information about the server and lists any official stakepools of the server, if it has any set up."
		},
		"nftCommands": {
			"policyid": "If this server has any official Cardano policy IDs and corresponding projects, they will be displayed when you use the */policyid* command. These policies can be for both fungible tokens and NFTs."
		},
		"whitelistCommands": {
			"whitelist": "You can use the */whitelist* command to see which whitelists are available on this server (via the *list* subcommand), or register and unregister from whitelists you qualified for via the respective *register* and *unregister* subcommands."
		},
		"adminCommands": {
			"title": "The following are commands for administrators only (normal users do not get this text when using */help*)",
			"configure-bans": "With */configure-bans* you can manage ban settings on your server, which allow exclusion of users, wallets or tokens from the server or role assignments/participation.",
			"configure-protection": "With */configure-protection* you can view and set up the scam and fake protection of the bot. It will let you set up automatic removal of messages with **addr1** as content, as well as an optional auditing of such messages to a dedicated channel for moderators.",
			"configure-settings": "Under */configure-settings* you can find subcommands that let you customize and control your bot to match your projects needs.",
			"configure-stakepool": "*/configure-stakepool* provides commands to add, list and remove stakepools for this Discord server. These are needed if you intend to set up delegator roles or if you want your pool information to be listed via the */info* command.",
			"configure-delegatorroles": "Once you have set up your official stakepool information via */configure-stakepool* you can assign roles based on delegation to specific pools. You will need the pool hash or you can reference \"all official pools of this Discord\" by leaving the pool hash parameter empty.",
			"configure-policy": "With */configure-policy* you can set up official policy IDs that users can inspect and easily find via the public */policyids* command.",
			"configure-tokenroles": "The */configure-tokenroles* command will allow you to set up automatic role assignments for users that have tokens of specific policies in their verified staking addresses. Users can verify via the public */verify* command.",
			"configure-whitelist": "With this command you can manage whitelists on this server that people can register for via the public */whitelist* command.",
			"configure-adminaccess": "The */configure-adminaccess* command allows you to manage which users can access administrative functions of the bot, like all the */configure* commands.",
			"configure-poll": "The */configure-poll* command enables the creation and management of polls and helps admins set up votings on their server, open or restricted to token-holders.",
			"configure-healthcheck": "With */configure-healthcheck* you can find out if there are any obvious misconfigurations or issues present in your bot that prevent normal operations.",
			"configure-marketplace": "Using */configure-marketplace* allows you to create sales, listing and mint trackers and configure them with rules for metadata and rarity information.",
			"start": "The */start* command is what you use to set the bot up initially, but also what you can use to reset your bot features and what you might be asked to run if new capabilities get added to the bot."
		}
	},
	"policyid": {
		"messageTitle": "Official policy IDs associated with this Discord",
		"purpose": "This is the official list of projects that are related to this server. This does not mean that this is the official Discord for the respective projects, but that the administrators of this server added them as policies here.\n💡 Please verify on the respective project website, if you are on their official Discord server before following any buy links etc.",
		"noProjectName": "No official policies",
		"totalPolicies": "\n\nThis server has **{{policyCount}}** active token policies:\n\n{{{policyString}}}",
		"noPolicies": "*Currently, this server has no token policies listed.*",
		"projectPolicyId": "The policy ID for this project is *{{policyId}}*"
	},
	"whois": {
		"messageTitle": "Whois Info",
		"noHandleFound": "⚠ The Handle **{{handle}}** is not currently in circulation.",
		"noHandleFoundMintTitle": "Mint it here ✨",
		"noHandleFoundMintText": "https://adahandle.com/mint",
		"noValidHandleOrAddress": "⚠ **{{addressOrHandle}}** is not a valid Handle or Cardano address and could not be resolved. Valid Handles start with a dollar sign and are followed by one to fifteen alphanumeric characters, periods, dashes or underscores. No other characters are allowed. Cardano addresses start with *addr1*.",
		"handleResolvedSuccess": "✅ The Handle **{{handle}}** was successfully resolved to the Cardano address *{{resolvedAddress}}*\n\n⚠ Be careful sending funds or tokens to Handles you do not know or if the resolved address does not look like what you expected.",
		"handleResolvedSuccessForUser": "✅ The user <@{{user}}> is known under the Handle **{{handle}}**. It was successfully resolved to the Cardano address *{{resolvedAddress}}*\n\n⚠ Be careful sending funds or tokens to Handles you do not know or if the resolved address does not look like what you expected.",
		"handleFoundTitle": "View on handle.me 👀",
		"handleFoundText": "https://handle.me/{{handleWithoutPrefix}}",
		"handleOnSale": "💡 The Handle **{{handle}}** is currently on sale at *{{marketplaceName}}*. If you are interested, this is your chance to snag it!",
		"handleOnSaleTitle": "Find on marketplace 🛒",
		"handlesForStake": "✅ The stake address **{{address}}** is currently associated with the following ADA Handles:\n\n",
		"handlesForWalletAddress": "✅ The wallet address **{{address}}** is currently associated with the following ADA Handles:\n\n",
		"handlesEntry": "   • **$**{{handle}}",
		"handlesForStakeNone": "❌ The stake address **{{address}}** is currently not associated with any ADA Handles.",
		"handlesForWalletAddressNone": "❌ The wallet address **{{address}}** is currently not associated with any ADA Handles.",
		"noDefaultHandle": "⚠ The user <@{{user}}> does not have a default ADA Handle configured."
	},
	"vote": {
		"messageTitle": "Current polls and decisions on this Discord",
		"purpose": "Find ongoing and completed polls on this server and view the results or vote, if you fulfill the required voting conditions.",
		"pollInfo": "{{{description}}}",
		"yourVote": "Your current vote",
		"pollInfoTitle": "Information about this poll",
		"optionList": "Multiple options allowed: {{multipleVotes}}\nToken-based vote: {{tokenBased}}\nWeighted vote: {{weighted}}",
		"currentResults": "Current results",
		"currentResultsTotalVotes": "Total votes: **{{formattedVoteCount}}**",
		"currentResultsTotalVoters": "Number of voters: **{{formattedVoterCount}}**",
		"resultsNotVisible": "The results of this poll are hidden until the team publishes them.",
		"yourVotingPower": "Your voting power",
		"votingPowerMultiple": "Based on token ownership for this poll you have a total voting power of **{{totalVotingPower}}{{unit}}** in your verified wallets.",
		"votingPowerSingleNoToken": "This poll is not token-based and as such you have a voting power of one.",
		"votingPowerSingleToken": "Based on the token ownership snapshot you have one vote in this poll.",
		"votingPowerNone": "You do not have any verified wallets that contained these tokens at the time of snapshot. If you think you had tokens at snapshot time, make sure to verify the respective wallet via **/verify add**.",
		"votingPowerTokenInfo": "💡 If you feel your voting power is not accurate, ensure all your wallets are linked. The snapshot for this poll may also be different from the current token count in your wallet.",
		"chooseVoteOption": "Choose what to vote for",
		"voteSuccess": "✅ You have successfully cast your vote. You can revote at any time using the */vote* command.",
		"changeVoteOption": "Change your vote",
		"choosePoll": "Pick the poll you'd like to know more about",
		"abstainVote": "Abstain/remove your vote",
		"abstainVoteSuccess": "✅ Your vote was successfully removed from the poll! You can revote at any time using the */vote* command.",
		"noPollsTitle": "No polls",
		"noPolls": "Currently, no available polls were found for this server.",
		"noPremium": "🙀 Users currently can not vote in polls as this server is not running **Black Edition**. Please contact your Discord admin to resolve this issue.",
		"voteButton": "Cast your vote",
		"errorNotEligible": "⚠ We are sorry, but this poll is archived or you are not eligible to vote at this time."
	},
	"join": {
		"joinGiveawayButton": "Join giveaway",
		"joinQuizButton": "Take quiz",
		"giveawayInfoTitle": "Information about this giveaway",
		"errorNotEligible": "⚠ We are sorry, but this giveaway is archived or you are not eligible to participate at this time.",
		"success": "✅ You have successfully entered this giveaway!",
		"successRemoval": "🗑️ You have removed your giveaway entry.",
		"yourEntry": "Your Entry",
		"yourEntryDetails": "You have **{{entries}}** entries in this giveaway.",
		"yourEntryMissing": "❌ You are currently not participating in this giveaway.",
		"currentParticipants": "Current Participants",
		"yourEntryWeight": "Your raffle entry count",
		"totalEntriesMultiple": "Based on token ownership for this giveaway you have a total of **{{totalEntries}}{{unit}}** raffle entries in your verified wallets.",
		"totalEntriesSingleNoToken": "This giveaway is not token-based and as such you have one entry.",
		"totalEntriesSingleToken": "Based on the token ownership snapshot you have one entry in this giveaway.",
		"totalEntriesNone": "You do not have any verified wallets that contained these tokens at the time of snapshot. If you think you had tokens at snapshot time, make sure to verify the respective wallet via **/verify add**.",
		"totalEntriesTokenInfo": "💡 If you feel your giveaway entry count is not accurate, ensure all your wallets are linked. The snapshot for this giveaway may also be different from the current token count in your wallet.",
		"removeEntry": "Remove your entry",
		"addEntry": "Join the giveaway",
		"startQuizText": "👋 Hello and welcome to our quiz **{{quiz.displayName}}**! We have a total of **{{questionCount}}** questions for you to answer and you need to answer **{{minimumCorrect}}** questions correctly to be eligible. {{{attemptsText}}}. Make sure to answer within **{{cacheDuration}} minutes** or you will have to redo all questions from the beginning.",
		"startQuizAttemptCount": "You have **{{attemptsPerQuestion}}** attempts per question",
		"startQuizUnlimitedAttempts": "You have as many attempts as you want for each question",
		"quizOutcomes": "Outcomes",
		"quizAwardedRole": "If you manage to answer all questions correctly, you will be awarded the role <@&{{quiz.awardedRole}}>.",
		"quizAddressWhitelist": "Completing the quiz will enable you to provide one of your verified addresses and give you a chance to win what is listed in the quiz description above.",
		"quizNoVerifiedAddresses": "⚠ You have no verified addresses, but will need to provide at least one address at the end of this quiz. Please verify first using the below button on the quiz announcement or the command **/verify add**.",
		"quizStartButton": "Start the Quiz!",
		"alreadyCompleted": "🙌 You have already completed this quiz on <t:{{completionTime}}> and provided the address *{{address}}*. Congratulations!",
		"alreadyCompletedNotQualified": "😅 You have already completed this quiz on <t:{{completionTime}}>. Thanks for participating!",
		"quizNotEnoughCorrectAnswers": "😅 You have completed the quiz! You had **{{correct}} out of {{total}}** correct answers. A minimum of **{{minimumCorrect}}** questions was needed to qualify for the prize. Best of luck next time!",
		"quizCompleteWithoutRole": "🙌 You have completed the quiz! You had **{{correct}} out of {{total}}** correct answers. You can now submit your address to complete your participation.",
		"quizCompleteWithRole": "🙌 You have completed the quiz! You had **{{correct}} out of {{total}}** correct answers. You can now submit your address and will receive your role <@&{{quiz.awardedRole}}> a few minutes after selecting your address/handle.",
		"quizAddressSubmitted": "🏁 You quiz completion was submitted successfully! Check our announcements regularly - you might find a prize in your wallet under the address *{{address}}* soon 😊",
		"firstQuestion": "▶ Alright, let's get started with question #{{questionNumber}}",
		"quizComplete": "🏁 Quiz complete!",
		"genericCompletionText": "You managed to get through all questions.",
		"correctAnswer": "✅ That's correct!",
		"correctAnswerNextQuestionTitle": "OK, here comes question #{{questionNumber}}",
		"attemptsReached": "❌ Unfortunately not",
		"attemptsReachedNextQuestionTitle": "Let us try question #{{questionNumber}}",
		"retryQuestion": "⏪ Unfortunately not, but let us try again",
		"chooseAddressForQuizPrize": "Select an address to receive your potential prize at"
	},
	"claim": {
		"messageTitle": "Claim your physical items",
		"purpose": "If you've minted a specific NFT or participated in an event or whitelist, you may be eligible to claim physical items. This command will let you pick your items and will then ask you for your shipping address via DM.\n💡 The system is opaque for the Discord operators and while they will receive your shipping address, they will not be provided with the associated stake address, keeping your personal data private.",
		"availableClaimListsTitle": "Claim lists available!",
		"availableClaimLists": "The following claim lists are available. Select your list and make sure you can receive direct messages from the bot, so it can ask you for your physical address.",
		"chooseClaimList": "Choose what you want to claim",
		"claimProductDetails": "You can claim this item {{available}} times.",
		"orderStartedTitle": "Order checkout started",
		"orderStarted": "⏳ Please check your direct messages from <@{{botUser}}> to finalize your order process.",
		"checkoutTitle": "Choose your items",
		"checkout": "ℹ Please choose the items you would like to claim. Below is a list of total claimable items - the bot will guide you through selecting the available choices for each of your items.",
		"existingOrderTitle": "Existing order found",
		"existingOrder": "💡 We have found an existing order for this claim list and <@{{botUser}}> has sent you the details. You can verify your order in your direct messages. Contact the project team, should you need to change your order.",
		"noDirectMessageTitle": "No Direct Messaging possible",
		"shoppingCart": "🛒 Your current cart",
		"shoppingCartEmpty": "No items in your cart.",
		"chooseShippingType": "Choose shipping type",
		"shippingTypeUSA": "Domestic (United States)",
		"shippingTypeInternational": "International",
		"enterShippingData": "Enter shipping address",
		"clearShoppingCart": "Empty shopping cart",
		"enterShipTo": "✍ Please enter your full name for your ship to address:",
		"enterCountry": "🏳 Please enter your country:",
		"enterPhone": "📞 For international orders, we need your phone number, including country code:",
		"enterCity": "🏙 Please enter your city name (and state, if applicable):",
		"enterStreet": "🛣 Please enter your full street address, including house number, apartment etc.:",
		"enterZipCode": "🔢 Please enter your zip code:",
		"addressEntryComplete": "☑ Address entry complete. Please verify your shopping cart contents and address information.\n💡 Once submitted, your order can only be changed by contacting the project team.",
		"checkoutComplete": "☑ You have successfully submitted your order. You can see your order details by running the */claim* command again in your respective Discord server. The project team will be in touch with updates on the delivery.",
		"checkoutError": "⚠ There was an error submitting your order. We apologize for the inconvenience. We suggest to start the process via */claim* once more, as there can be problems if the order entry takes longer than 15 minutes overall from the initial claim to completion. If the error persists on the second attempt we ecommend getting in touch with the project team. Make sure to write down the current time and time zone, so we can find the problem easier.",
		"currentAddress": "📦 Shipping To",
		"currentAddressData": "{{shipTo}}\n{{street}}\n{{zipCode}} {{city}}\n{{country}}\n{{phone}}",
		"noCurrentOrderProcessTitle": "No order in process",
		"noCurrentOrderProcess": "⚠ Sorry, there is no current order active, so I cannot respond properly. If you are reacting to an older message please start the order process again in the respective Discord by running */claim*.",
		"noDirectMessage": "⚠ The bot is not able to send you a direct message, which means it will not be able to collect your shipping address. Please click on the server name, select **Privacy Settings** and enable **Allow direct messages from server members**. You can disable it again after the claim process is complete.",
		"noClaimListsTitle": "No claim lists available",
		"noClaimLists": "*Currently, you do not qualify for any claim lists.*\n\nℹ If you think you qualify, make sure your respective staking address is verified and linked via the */verify list*, */verify add* and */verify link* commands.",
		"submitOrder": "Submit order",
		"helpChannelTitle": "Help with your order",
		"helpChannel": "If you need assistance with your order, please get in touch with our team in the channel <#{{helpChannel}}>. We are happy to help you out.",
		"noDescription": "No Description provided",
		"trackingNumberTitle": "Tracking Number",
		"trackingNumberDetails": "Your tracking number is **{{trackingNumber}}** and you can follow it via this [Google Search](https://www.google.com/search?q={{trackingNumber}}). If the search does not yield any results, reach out to the project team to get your shipping provider.",
		"orderOnlineTitle": "Claim URL provided",
		"orderOnline": "The project team has provided the following URL to get your order and shipping details ready. Thanks for supporting this project!:\n\n"
	},
	"premium": {
		"messageTitle": "View your premium status",
		"purpose": "Here you can see your claimable **$HAZEL** balance and see if you have pledged your support to this project. You can also check if you're the winner of a recent premium giveaway.",
		"premiumStatus": "Premium Status",
		"premiumStatusNo": "You are currently not a premium user. Simply visit {{{stakeLink}}} and use the **Stake for Premium** button. Any staked ADA on any of your verified wallets will get you premium status - no minimum required.\n\nClaimable **$HAZEL** balance: {{tokenBalance}}",
		"premiumStatusYes": "Thanks for supporting HAZELnet with your stake! 😻\n\nYour current amount staked with us: {{stakeAmount}} ADA\nClaimable **$HAZEL** balance: {{tokenBalance}}",
		"serverSupport": "Server Support",
		"serverSupportYes": "You have pledged ~ {{stakeAmountPerServer}} ADA each to the following Discord servers:\n",
		"serverSupportEntry": "   • {{{serverName}}}",
		"serverSupportNo": "You have not pledged your staked ADA to a Discord server. You can choose to support one or more Discord servers with your stake, without any downsides. Pledging your HAZEL premium account to a server means directly supporting your project.\n\nYou can change this at any time.",
		"benefits": "Premium Benefits",
		"benefitsDetails": "• No advertisements\n• Automatic entry into a giveaway every epoch\n• Priority Support\n• Gain **$HAZEL** based on your stake\n   ◦ Vote on new features and events with your $HAZEL\n   ◦ Participate in extra giveaways with your $HAZEL\n   ◦ Gain access to exclusive whitelists\n",
		"giveaway": "Current Giveaway",
		"pledgeButtonYes": "Pledge your support to {{{guildName}}}",
		"pledgeButtonNo": "Revoke your pledge to {{{guildName}}}",
		"cannotPledge": "Link to pledge",
		"cannotPledgeDetails": "⚠ You must link your wallet to be able to pledge your stake to this project or see your details. Please run **/verify link** or **/verify add** to link your existing verifications or verify your wallet."
	},
	"verify": {
		"list": {
			"messageTitle": "Your verified addresses",
			"noVerifications": "You have no outstanding or confirmed verifications. If you would like to verify a Cardano address, please use the '/verify add' command.",
			"listVerificationsInfo": "View your link status with this specific server and see which addresses are verified or waiting for verification with your account across all your Discord servers:",
			"confirmedVerificationFor": "✅ Confirmed verification for {{stakeShort}}…",
			"confirmedData": "Address *{{verification.address}}* for stake address https://pool.pm/{{verification.cardanoStakeAddress}} via transaction https://cardanoscan.io/transaction/{{verification.transactionHash}}, confirmed at *{{verification.confirmedAt}}*.",
			"confirmedDataImport": "Address *{{verification.address}}* for stake address https://pool.pm/{{verification.cardanoStakeAddress}} from *{{{verification.transactionHash}}}*, imported at *{{verification.confirmedAt}}*.",
			"outstandingVerifications": "⏳ Outstanding verifications",
			"outstandingData": "Waiting for **₳{{amount}}** to be sent to *{{verification.address}}* for a successful verification.",
			"accountIsLinked": "⚡ Linked",
			"accountIsLinkedInfo": "Your verified wallets are linked with this Discord server and you will be automatically assigned roles and access other features, if configured by the server admin.\nℹ To unlink, use */verify unlink*",
			"accountIsNotLinked": "🔌 Not Linked ⚠",
			"accountIsNotLinkedInfo": "Your verified wallets are not linked with this Discord server and your privacy is ensured. No automatic role assignments will be done and you cannot use any other features that require a verified wallet.\nℹ To link your already verified wallets to this server, use */verify link*",
			"cancelOutstanding": "Cancel open verification",
			"cancelSuccess": "❌ Outstanding verification for address {{address}} was successfully cancelled. You can now start a new verification process."
		},
		"help": {
			"messageTitle": "Help about the /verify command"
		},
		"add": {
			"messageTitle": "Verify a new address",
			"alreadyVerified": "✅ Found an existing verification for your user and the address *{{address}}*. Your stake address **{{verification.cardanoStakeAddress}}** is successfully registered on this server.",
			"outstandingVerification": "⏳ Found an outstanding verification on this or another server. Please complete your other verification first. You can find your outstanding verification details with the */verify list* command.",
			"verificationRequest": "⌛ Please send **₳{{amount}}** to your own address at *{{verification.address}}* within the next {{maxTime}} minutes.\n\n⚠ Do not include any other tokens and make sure to send from (and to) the wallet that owns this address. Transactions that include outputs to any other addresses will not be considered and your fees will not be reimbursed by HAZELnet.io or the operator of this Discord server.\n\n💡 If you close Discord, you can use */verify list* to get your verification data later.",
			"verificationSuccess": "✅ You are now verified with stake address **{{verification.cardanoStakeAddress}}** through transaction *{{verification.transactionHash}}*. Thank you!",
			"verificationWaiting": "⏳ Still awaiting verification…\n\n💡 If you close Discord, you can use */verify list* to get your verification data later.",
			"verificationFailure": "⚠ Verification failed as no transaction with the required data was found on the blockchain. Please try again using the '/verify add' command.",
			"verificationMessageChainEnd": "⏳ We are still waiting for your transaction. However, the bot will now stop messaging you. You can check your verification request status any time by using the */verify list* command.",
			"verificationWalletInUse": "⚠ Verification failed. The stake address that belongs to the address *{{address}}* is already verified with your or another account.",
			"verificationInvalidAddress": "⚠ The submitted address *{{address}}* is not associated with a stake address OR the verification process was cancelled. Please supply a valid wallet address (starts with addr1 and has 103 characters total) or $handle.",
			"verificationInvalidHandle": "⚠ The submitted handle *{{handle}}* is not associated with a stake address. {{{resolveText}}}. Please supply a valid wallet address (starts with addr1 and has 103 characters total) or $handle.",
			"resolveFailure": "The handle did not resolve to any address",
			"resolveSuccess": "The handle resolved to {{resolvedAddress}}",
			"verifyButton": "Verify your wallet",
			"widgetInstructionsAlreadyVerified": "🚨 You have {{verifiedWallets}} verified wallets. If you would like to see which ones, use **/verify list** in a channel where commands are enabled.",
			"widgetInstructions": "💡 You can verify your wallet by running the command **/verify add** in a channel that allows commands. You will need to provide a wallet address (*addr1…*) or *$handle* you would like to verify. The bot will then ask you to send a specific ADA amount from your own wallet to your own wallet to confirm ownership.\n\n❔ For more information, use **/verify help** and **/help**.",
			"blacklistedTitle": "Blocked",
			"blacklisted": "🛑 Your account is currently blocked from using HAZELnet."
		},
		"remove": {
			"messageTitle": "Remove a verified address",
			"success": "❗ All verifications with address *{{address}}* for this Discord account have been removed. This affects all Discord servers for which this verification was used!"
		},
		"link": {
			"messageTitle": "Link your wallets to this Discord server",
			"success": "⚡ Your verified wallets and addresses have been successfully linked to this server. You are now eligible for any automatic role assignments and other features that require verified wallets. Role updates will happen during the next update.",
			"notLinked": "⚠ Your user is already linked with this Discord server.",
			"importSuccessTitle": "Imported external verifications",
			"importSuccess": "🔃 One or more addresses were imported from other verification systems, as listed below. Use **/verify list** to see further details for the imported entries.\n\n{{{importedVerificationsText}}}",
			"importEntry": "• *{{address}}*… from {{{source}}}"
		},
		"unlink": {
			"messageTitle": "Unlink your wallets from this specific Discord server",
			"success": "🔌 Your verified wallets and addresses have been successfully unlinked from this server. You will not receive any further role assignments on this server and all existing automatic role assignments will be removed during the next scheduled update.",
			"notLinked": "⚠ Your user is currently not linked with this Discord server."
		}
	},
	"whitelist": {
		"list": {
			"messageTitle": "Whitelists for this server",
			"purpose": "These are all currently active or recently closed whitelists for this Discord server:",
			"noWhitelistsTitle": "No whitelists",
			"noWhitelistsDetail": "*Currently, this server has no open or recently closed whitelists.*",
			"whitelistNoRoleRequirement": "No role is required to sign up for this whitelist. ",
			"whitelistRoleRequirementSingle": "Requirement for this whitelist is to have the role <@&{{roleId}}>.",
			"whitelistRoleRequirementMultiple": "Requirement for this whitelist is to have one of the following roles:",
			"whitelistRoleEntry": "• <@&{{roleId}}>",
			"whitelistRoleAwarded": "Once signed up, the user will receive the role <@&{{whitelist.awardedRole}}>. ",
			"whitelistWithEndDateOpen": "Signup is open until <t:{{signupUntilTimestamp}}>.",
			"whitelistWithEndDateClosed": "Signup closed at <t:{{signupUntilTimestamp}}>.",
			"whitelistWithStartDateOpen": "Signup opened at <t:{{signupAfterTimestamp}}>.",
			"whitelistWithStartDateClosed": "Signup will open at <t:{{signupAfterTimestamp}}>.",
			"whitelistWithStartDateClosedAndOpenEndDate": "Signup will open at <t:{{signupAfterTimestamp}}> and will be available until <t:{{signupUntilTimestamp}}>.",
			"whitelistWithStartDateOpenAndOpenEndDate": "Signup opened at <t:{{signupAfterTimestamp}}> and will be available until <t:{{signupUntilTimestamp}}>.",
			"whitelistWithStartDateOpenAndClosedEndDate": "Signup opened at <t:{{signupAfterTimestamp}}> and closed at <t:{{signupUntilTimestamp}}>.",
			"whitelistLaunchDate": "\n🚀 The team has published a launch date for <t:{{launchDateTimestamp}}>.",
			"whitelistManuallyClosed": "\n⏸ The signup for this whitelist is currently paused by an administrator.",
			"openWhitelist": "There are no start or end dates for this registration.",
			"whitelistMembersNoLimit": "Any number of users can sign up.",
			"whitelistMembersLimit": "{{whitelist.currentUsers}} out of {{whitelist.maxUsers}} have already registered.",
			"whitelistMembersLimitNoCurrent": "The whitelist is limited to {{whitelist.maxUsers}} users that can register.",
			"whitelistMembersLimitReached": "All {{whitelist.maxUsers}} users have already registered.",
			"youQualify": "✅ You qualify for this whitelist. Add your address via '/whitelist register', if you would like to sign up.",
			"youDontQualify": "⛔ You currently do not qualify for this whitelist.",
			"youAreRegistered": "♥ You successfully registered for this whitelist at <t:{{signupTime}}>.",
			"youAreRegisteredWithAddress": "♥ You successfully registered for this whitelist at <t:{{signupTime}}> with the address *{{address}}*",
			"showWithAddresses": "Show with addresses on screen",
			"externalWhitelists": "Whitelists from other servers",
			"externalWhitelistsDetail": "Here is a list of whitelists you have successfully signed up for on other servers. If the project has submitted a launch date, this is included as well so you know when to be ready!",
			"externalWhitelistsEntry": "• **{{{whitelistDisplayName}}}** on Discord *{{{guildName}}}*.{{{launchDateText}}}",
			"launchDateText": " The launch date is set for <t:{{launchDateTimestamp}}>"
		},
		"register": {
			"messageTitle": "Register for a whitelist",
			"purpose": "Choose the whitelist you would like to register for:",
			"signedupFor": "You are currently registered for the following whitelists:",
			"signedupForEntry": "• **{{{whitelist.displayName}}}**",
			"chooseWhitelist": "Select your whitelist",
			"noOpenWhitelists": "There are currently no further whitelists that you qualify for.\n\n💡 If you verified your wallet within the last few minutes, please wait at least one hour for the automatic role-assignments to take effect. Then try again.",
			"registerButton": "Register for this whitelist",
			"success": "✅ Congratulations, you have successfully registered for the whitelist **{{{whitelist.displayName}}}**!",
			"successUsedAddress": "\n\nUsed address (if you entered a $handle, it was resolved to an address immediately): *{{address}}*",
			"successAwardedRole": "\n\nYou will receive the whitelist role <@&{{awardedRole}}> shortly and keep it as long as you remain registered for this whitelist.",
			"invalidAddress": "This does not look like a valid address: *\"{{address}}\"*. If you used a $handle, please ensure it is correct.\n\nPlease verify you are using a valid {{blockchain}} address to register. Example addresses look as follows *{{example}}*.",
			"errorNotFound": "⚠ Your registration was not successful. No whitelist with the name/ID **{{whitelistName}}** was found for this server.",
			"otherError": "⚠ Error while registering for this whitelist.",
			"errorNoAddress": "⚠ You have to provide an ADA Handle or wallet address as an option for the **/whitelist register** command, for this whitelist type. If you did provide one, ensure to complete the whitelist registration process in under 10 minutes.",
			"noPremium": "🙀 Users currently can not register for any whitelists as this server is not running **Black Edition**. Please contact your Discord admin to resolve this issue.",
			"widgetNotVerified": "⚠ You currently have no verified wallets. You can use the command **/whitelist register** in a channel that allows bot commands to register any address (*addr1…*) or *$handle* for this whitelist.\n\n💡 **Better**: We recommend verifying a wallet via **/verify add** and then registering it with the whitelist by clicking the same button again.",
			"widgetNotVerifiedAlreadyRegistered": "✅ You have already registered for the whitelist **{{whitelist.displayName}}** at <t:{{signupTime}}> with the address *{{addressShort}}*.\n\nYou can use the command **/whitelist register** in a channel that allows bot commands to register a different address (*addr1…*) or *$handle* for this whitelist.",
			"widgetSelectAddress": "Please select which of your verified wallets you would like to register for the whitelist\n\n**{{whitelist.displayName}}**\n\nIf you would like to register a non-verified address or $handle, simply use the **/whitelist register** command.",
			"widgetSelectAddressAlreadyRegistered": "✅ You have already registered for the whitelist **{{whitelist.displayName}}** at <t:{{signupTime}}> with the address *{{addressShort}}*. If you would like to change your used address, select the new address below.\n\nIf you would like to register a non-verified address or $handle, simply use the **/whitelist register** command.",
			"chooseAddressToWhitelist": "Select one of your verified addresses to register",
			"alreadyRegisteredTitle": "You're good! 👍",
			"userDoesNotQualify": "💔 Unfortunately, you currently do not qualify for this whitelist or it is already closed/full."
		},
		"unregister": {
			"messageTitle": "Unregister from a whitelist",
			"purpose": "Choose the whitelist you would like to remove yourself from:",
			"chooseWhitelist": "Select your whitelist",
			"success": "✅ You have successfully removed yourself from the whitelist \"**{{{whitelist.displayName}}}**\". We're sorry to see you go and hope you'll be back soon.",
			"errorNotFound": "⚠ Your unregistration was not successful. No whitelist with the name **{{whitelistName}}** was found for this server.",
			"noRegisteredWhitelists": "⚠ You are currently not registered for any whitelists.",
			"otherError": "⚠ Error while deleting your whitelist registration info."
		}
	},
	"ping": {
		"send": {
			"messageTitle": "Ping an unknown user",
			"purpose": "You are about to send a message via HAZELnet to the user associated with your recipient **{{targetShort}}**.",
			"success": "✅ You have successfully pinged the user associated with your recipient **{{targetShort}}**.\n\n💡 Please be aware that the recipient can choose to ignore your message - this does not mean it was not delivered. We take the privacy of our users extremely seriously and discourage the recipient to respond to suspicious messages or spam. If you are reported for abusing the system, your account may be suspended.",
			"messageContentTitle": "Message Content",
			"messageContentEmpty": "The ping message will just provide your Discord handle and server you are sending the message from.",
			"messageContent": "The ping message will include your Discord handle and server you are sending the message from, as well as the following text:\n\n{{{message}}}",
			"clickBelowToSend": "\n\n👇 Click below to confirm you want to send your ping.",
			"recipientAcknowledgement": "\n\n💡 Please be aware that the recipient can choose to ignore your message - this does not mean it was not delivered. We take the privacy of our users extremely seriously and discourage the recipient to respond to suspicious messages or spam. If you are reported for abusing the system, your account may be suspended.",
			"pingLimitTitle": "Ping limit",
			"pingLimitStandard": "💡 You can currently ping once every 24 hours. If you would like to ping more frequently, considering staking with our partner pool by running the command **/premium**. Any staked amount will give you access to a Black Edition account tier and support the development of this project.",
			"pingLimitPremium": "🐈 Thanks for supporting HAZELnet with your stake! Your Black Edition account allows you to ping a user once every 60 minutes.",
			"pingButton": "Ping user",
			"invalidHandle": "⚠ The handle (*{{target}}*) does not look like a valid handle. It has to start with $ and can have at most 15 characters. Please provide a valid handle to ping.",
			"invalidAssetFingerprint": "⚠ The asset (*{{target}}*) does not look like a valid asset fingerprint (starts with asset1 and has 44 characters total). Please provide a valid asset fingerprint to ping.",
			"invalidAddress": "⚠ The address (*{{target}}*) does not look like a valid wallet address (starts with addr1 and has 103 characters total) or staking address (starts with stake1). Please provide a correct address to ping.",
			"unknownPingType": "⚠ Unknown ping type.",
			"pingTargetNotFound": "⚠ Unfortunately, the submitted target *{{targetShort}}* is not associated with a verified stake address within our system and could not be pinged.",
			"pingTooOften": "⚠ We are limiting pinging users to prevent abuse. Please wait {{waitTime}} {{waitUnits}} until you can ping again.",
			"waitUnitsMinutes": "minutes",
			"waitUnitsHours": "hours",
			"tooLongMessage": "⚠ Your ping message can be at most {{maxMessageLength}} characters long - please write a shorter message.",
			"messageContainsUnsafePhrases": "⚠ Ping messages are not allowed to contain addresses, URLs or handles for the safety of the recipient. Please adjust your ping message accordingly.",
			"pingOtherError": "⚠ An unknown error ocurred trying to ping the desired target. We apologize for the inconvenience and suggest reaching out to the project team for help.",
			"failedTimeout": "⚠ This ping is no longer available. Please create a new ping.",
			"reportPing": "Report this ping as a scam attempt",
			"pingRecipientTitle": "You were pinged!",
			"pingRecipientText": "The user <@{{sender}}> has pinged you from the server *{{{guildName}}}*. They have used the {{targetType}} **{{target}}** to reach you and did not receive any Discord information about you. You can decide to respond by contacting them on the respective Discord server or messaging them directly.",
			"pingTargetTypeNft": "NFT with asset fingerprint",
			"pingTargetTypeHandle": "ADA $handle",
			"pingTargetTypeAddress": "Cardano address",
			"pingRecipientMessageTitle": "They have attached the following message",
			"pingRecipientAdditionalTitle": "Additional information",
			"pingRecipientAdditionalContent": "⚠ We highly recommend to not react to any messages that look suspicious to you. Never start an escrow based on Discord messages or send any funds. Use websites like jpg.store and tradingtent.io to safely trade assets.\n\n💡 If you would like to turn off message pings, simply run the command **/profile toggle** in any HAZELnet-enabled Discord to turn off the feature. You can always list recent pings via **/ping list** (even if message-pings are disabled).",
			"reportTitle": "The ping has been reported",
			"reportContent": "Thank you for reporting this ping. We will continually investigate repeat-offenders and start blocking their access to the ping feature if abuse is confirmed."
		},
		"list": {
			"messageTitle": "Recent pings",
			"purpose": "Here are your most recent sent and received pings. Pings will be deleted from this list after seven days.",
			"receivedPingsTitle": "Received pings",
			"receivedPingsNone": "📪 No recently received pings",
			"receivedPing": "Ping from <@{{senderLocal}}> to **{{targetShort}}** on *<t:{{sentTime}}>* with message \"{{{message}}}\".",
			"sentPingsTitle": "Sent pings",
			"sentPing": "Sent to **{{targetShort}}** on *<t:{{sentTime}}>*",
			"sentPingsNone": "✉ No recently sent pings",
			"testPingReceive": "Click to test if you can receive ping messages",
			"testPingTestMessage": "This is an example message you might receive",
			"noDirectMessageTitle": "No Direct Messaging possible",
			"noDirectMessage": "⚠ The bot is not able to send you a direct message, which means it will not be able to send you message pings. Please click on the server name, select **Privacy Settings** and enable **Allow direct messages from server members**. Unfortunately, bots cannot be added as friends to allow them to send you messages at all times while keeping direct messages off.\n\n💡 You can regularly check your received pings with **/ping list** if you do not want to open up your DMs.",
			"testMessageSentTitle": "Test message sent",
			"testMessageSentContent": "A test message has been sent to your Discord account. Please check your DMs."
		}
	},
	"profile": {
		"toggle": {
			"messageTitle": "Change your profile settings",
			"purpose": "Here are your current profile settings. You can switch the ones that are toggleable on or off by selecting them in the dropdown below.",
			"chooseSetting": "Choose the setting you want to toggle",
			"turnOn": "✅ Turn on: {{option}}",
			"turnOff": "❌ Turn off: {{option}}",
			"OPTION_RECEIVEPINGS": "Receiving pings from other users",
			"OPTION_RECEIVEPINGS_on": "✅ You currently have turned on receiving pings from other users.",
			"OPTION_RECEIVEPINGS_off": "❌ You currently do not receive pings from other users.",
			"OPTION_RECEIVEPINGS_info": "💡 When this feature is enabled, the bot will try to notify you via private Discord message if another user is trying to ping you based on an item in your wallet. The other user will never see your Discord information and you choose if you want to respond. On or off, you will always be able to see the most recent pings via **/ping list**"
		},
		"defaulthandle": {
			"messageTitle": "Change your default ADA Handle",
			"purpose": "Here you can set your default ADA Handle that people will see when they look up your account, or turn the default off.\n\n💡 If your ADA Handle does not appear in this list (it can show a maximum of 25), please run the command again, with the *handle* parameter set to your preferred default handle.",
			"currentDefaultHandleTitle": "Current handle",
			"currentDefaultHandle": "Your current default ADA Handle is set to **{{handle}}**.",
			"currentDefaultHandleNotOwned": "⚠ However, it is currently not held in any of your verified addresses and will not be shown to other users.",
			"chooseHandle": "Choose your preferred ADA Handle",
			"removeDefaultHandle": "Remove default handle",
			"resetSuccess": "🗑️ Successfully removed your previous default ADA Handle **{{handle}}**.",
			"success": "✅ You have successfully set your new default ADA Handle to **{{handle}}**. When other members right click your name in Discord or query your account, this handle will be displayed for them.",
			"errorNotOwned": "⚠ The ADA Handle **{{handle}}** is not present in any of your currently verified stake addresses and could not be assigned as your standard handle.",
			"errorNoHandle": "**{{handle}}** is not a valid ADA Handle. Valid Handles start with a dollar sign and are followed by one to fifteen alphanumeric characters, periods, dashes or underscores."
		}
	},
	"configure": {
		"verify": {
			"info": {
				"purpose": "Has it tho?"
			},
			"announce": {
				"purpose": "You are about to create a verification widget and announcement in the channel <#{{channel}}>. The widget will contain your provided welcome text as shown below, and buttons to initiate verification via HAZELnet. Please confirm below if you want to continue.",
				"success": "✅ Verification widget successfully published in <#{{channel}}>.",
				"publicSuccessTitle": "✅ Verify here!",
				"publicSuccess": "You can verify your wallet here, or quickly link your already verified wallets with this Discord by clicking the below button.",
				"publish": "Create announcement",
				"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages** and **Embed Links** permissions for the bot to allow announcing in it.",
				"errorWrongChannelType": "This channel cannot be used for verification announcements."
			}
		},
		"info": {
			"epochclock": {
				"epochclockOn": "✅ The voice channel <#{{epochclock}}> has been turned into an Epoch clock. Watch the Epoch count down ☺",
				"epochclockOff": "❌ The Epoch clock has been turned off on your server.",
				"errorWrongChannelType": "⚠ Only guild voice channels can be used for this type of widget.",
				"errorChannelPermissions": "⚠ It looks like the bot does not have permissions to change the channel. Please make sure to grant the bot role **View Channel**, **Connect** and **Manage Channel** permissions at the role or voice channel level, so it can adjust the name."
			},
			"rolecounter": {
				"rolecounterOn": "✅ The voice channel <#{{rolecounter}}> has been turned into an role counter for the role <@&{{roleId}}>. Watch the roles roll in ☺",
				"rolecounterOff": "❌ The role counter for <@&{{roleId}}> has been turned off on your server.",
				"errorWrongChannelType": "⚠ Only guild voice channels can be used for this type of widget.",
				"errorChannelPermissions": "⚠ It looks like the bot does not have permissions to change the channel. Please make sure to grant the bot role **View Channel**, **Connect** and **Manage Channel** permissions at the role or voice channel level, so it can adjust the name.",
				"noPremium": "🙀 You currently can not configure role counters as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
			}
		},
		"policy": {
			"list": {
				"purpose": "This is the list of official policies that this server will present when end users use the /policyid command.\n\n⚠ Do not add policy IDs for projects that are not your own or that you are not officially supporting. Reports of misused policy IDs will be taken seriously by the team and may result in your server being blacklisted for HAZELnet usage."
			},
			"add": {
				"success": "✅ New official token policy added for this Discord server!",
				"errorAlreadyUsed": "⚠ Error while adding your token policy. This policy ID is already added under the name **{{projectName}}**. Each policy ID can only be added once."
			},
			"remove": {
				"success": "🗑️ Removed the following token policy from the official token policy list of this server:",
				"errorNotFound": "⚠ No policy with the ID **{{policyId}}** was found for this server. Nothing was removed."
			},
			"announce": {
				"purpose": "You are about to create a policy ID widget and announcement in the channel <#{{channel}}>. The widget will contain your provided info text as shown below, as well as a list of all the official project names and corresponding policy IDs of this server. Please confirm below if you want to continue.",
				"success": "✅ Policy ID widget successfully published in <#{{channel}}>.",
				"publicSuccessTitle": "📃 Project & Policy ID list",
				"publicSuccess": "Here is the list of supported policy IDs of this server.\n\n💡 Keep in mind, that a policy ID being listed here does not mean that this the official server of this project. Always verify with other sources before making a purchase or trading.",
				"infoMessage": "Info Message",
				"publicSuccessTitleContinued": "📃 Project & Policy ID list (continued)",
				"publish": "Create announcement",
				"projectName": "Project: {{{projectName}}}",
				"policyId": "*{{policyId}}*",
				"errorNoPolicies": "⚠ You currently have not set any project names and policy IDs for this server. Please add a project first by using the command **/configure-policy add**.",
				"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages** and **Embed Links** permissions for the bot to allow announcing in it.",
				"errorWrongChannelType": "This channel cannot be used for policy ID announcements."
			},
			"mintcounter": {
				"mintcounterOn": "✅ The voice channel <#{{mintcounter}}> has been turned into an mint counter. Watch your project grow.",
				"mintcounterOff": "❌ The mint counter has been turned off on your server.",
				"mintCount": "🔢 {{count}} minted",
				"mintCountWithMax": "🔢 {{count}}/{{maxCount}} minted",
				"errorWrongChannelType": "⚠ Only guild voice channels can be used for this type of widget.",
				"errorChannelPermissions": "⚠ It looks like the bot does not have permissions to change the channel. Please make sure to grant the bot role **View Channel**, **Connect** and **Manage Channel** permissions at the role or voice channel level, so it can adjust the name."
			}
		},
		"social": {
			"announce": {
				"purpose": "You are about to create a announcement in the channel <#{{channel}}>. The announcement will contain the text you send as the next message in this channel in the next five minutes. You can use any Discord markdown you want and will receive a preview of your announcement before submitting it.",
				"success": "✅ Announcement successfully published in <#{{channel}}>.",
				"publish": "Create announcement"
			}
		},
		"stakepool": {
			"list": {
				"purpose": "This is the list of official stakepools that this server will present when end users use the /info command.\n\n⚠ Do not add stakepools that are not your own or that you are not officially supporting. Reports of misused stakepools will be taken seriously by the team and may result in your server being blacklisted for HAZELnet usage.",
				"noPoolName": "No official stakepools",
				"noPools": "*Currently, this server has no stakepools listed.*"
			},
			"add": {
				"success": "✅ New official stakepool added for this Discord server!"
			},
			"remove": {
				"success": "🗑️ Removed the following stakepool from the official stakepool list of this server:",
				"errorNotFound": "⚠ No stakepool with the hash **{{stakepoolHash}}** was found for this server. Nothing was removed."
			}
		},
		"bans": {
			"list": {
				"purpose": "This is the list of active bans on your server.\n\n{{{banText}}}",
				"banEntryTitle_STAKE_ADDRESS_BAN": "Stake address (Ban ID: {{banId}})",
				"banEntryTitle_ASSET_FINGERPRINT_BAN": "Asset Fingerprint (Ban ID: {{banId}})",
				"banEntry_STAKE_ADDRESS_BAN_PREVENT_ROLES": "*{{pattern}}* is not considered for token/delegation roles.",
				"banEntry_ASSET_FINGERPRINT_BAN_PREVENT_ROLES": "*{{pattern}}* is not considered for token roles.",
				"purposeContinued": "Ban list (continued)",
				"noBansName": "No active bans",
				"noBans": "*Currently, this server has no active bans.*",
				"chooseDetails": "Choose the ban you want to get details for",
				"chooseText": "Ban-ID: {{banId}}",
				"detailsPurpose": "Information about the ban you selected:",
				"errorNotFound": "⚠ No ban with the ID **{{banId}}** was found for this server.",
				"banReasonTitle": "Ban reason",
				"banReasonNoneGiven": "*None given*",
				"bannedByTitle": "Banned by",
				"bannedByUnknown": "*Unknown*",
				"banTimeTitle": "Banned at"
			},
			"add": {
				"success": "✅ New ban rule added for this Discord server!",
				"banFailStakeAddress": "⚠ The ban for stake address *{{pattern}}* was not added. A valid stake address in our accepted format **starts with stake1 and has 59 characters** total.",
				"banFailAssetFingerprint": "⚠ The ban for asset fingerprint *{{pattern}}* was not added. A valid asset fingerprint **starts with asset1 and has 44 characters** total.",
				"proposedBanReason": "Proposed ban reason"
			},
			"details": {
				"purpose": "Here are the details on the given ban you have requested."
			},
			"remove": {
				"success": "🗑️ Removed the following ban rule from this server:",
				"errorNotFound": "⚠ No ban with the ID **{{banId}}** was found for this server. Nothing was removed."
			}
		},
		"protection": {
			"status": {
				"purpose": "The following protection mechanisms are active on this server:",
				"protectionTitle": "Protection from addr1-scams",
				"auditChannelTitle": "Auditing of potential scam messages and events"
			},
			"addressremove": {
				"protectionOn": "✅ Your server is protected from scams based on users sending messages containing Cardano *addr1* addresses or Ethereum *0x* addresses. These messages will be automatically removed in all channels where this bot has permissions to view and manage messages.",
				"protectionOff": "⚠ You have turned off the autoremoval of text messags that contain Cardano or ETH addresses, for protection of your users from address-based scams."
			},
			"auditchannel": {
				"auditChannelOn": "✅ Suspicious messages and events in your server will be sent to the channel <#{{auditChannel}}>, if the bot has permissions to send messages to this channel.",
				"auditChannelOff": "⚠ No audit channel has been configured. No potential scam-messages or events will be logged.",
				"auditEventTitle": "⚠ Potential Scam Attempt",
				"auditEventDetail": "User <@{{author}}> sent a suspicious message to channel <#{{{channel}}}> with content \"{{message}}\""
			}
		},
		"engagement": {
			"activityreminder": {
				"activityreminderOn": "✅ Activity reminder messages will be sent to the channel <#{{reminderChannel}}> after users are inactive for {{inactivityDays}} days, if the bot has permissions to send messages to this channel.",
				"activityreminderOff": "⚠ No activity reminder channel has been configured. No reminders will be sent when users are inactive.",
				"noPremium": "🙀 You currently can not configure engagement features as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status.",
				"minimumActivityDays": "⚠ You cannot configure activity reminders that run more frequently than once a day.",
				"announceTitle": "Hey there {{userName}}!",
				"announceTextPrefixWithMention": "Hi <@{{userId}}>. ",
				"announceText": "Long time no see, <@{{userId}}>. We are glad you joined our community and would love for you to chat with us. Swing by any of our channels to see what is new 🙂"
			},
			"downloadusers": {
				"success": "Successfully compiled a list of **{{userCount}}** users with the role <@&{{role}}> for your server. Please find the CSV file attached.",
				"noUsersInRole": "⚠ No users with the role <@&{{role}}> were found on your server."
			}
		},
		"tokenroles": {
			"list": {
				"purpose": "This is the list of Discord roles that will be automatically assigned, based on token (NFT and FT) ownership by verified users.",
				"detailsPurpose": "Information about the token role you selected:",
				"noTokenRolesTitle": "No token roles",
				"noTokenRolesDetail": "*Currently, this server has no token-based roles configured.*",
				"tokenRoleNameOfficial": "Project \"{{{officialProject.projectName}}}\" (Role-ID: {{tokenRole.id}})",
				"tokenRoleNameInofficial": "{{policyIdShort}} (Role-ID: {{tokenRole.id}})",
				"tokenRoleNameMultiple": "Multiple policies (Role-ID: {{tokenRole.id}})",
				"tokenRoleDetails": "All verified users that own a total of at least {{tokenRole.minimumTokenQuantity}}{{{maximumInfo}}} tokens of the accepted policies will be assigned the role <@&{{tokenRole.roleId}}>.",
				"tokenRoleDetailsWithFilters": "All verified users that own a total of at least {{tokenRole.minimumTokenQuantity}}{{{maximumInfo}}} tokens of the accepted policies and match the configured metadata filters will be assigned the role <@&{{tokenRole.roleId}}>.",
				"tokenRoleDetailsWithFiltersEachOne": "All verified users that own at least one unique token corresponding to each added metadata filter will be assigned the role <@&{{tokenRole.roleId}}>. All configured policies will be considered.",
				"tokenRoleDetailsEveryPolicyNoFilters": "All verified users that own at least one token from every configured policy/asset fingerprint combination will be assigned the role <@&{{tokenRole.roleId}}>.",
				"tokenRoleDetailsEveryPolicyWithFilters": "All verified users that own at least one token from every configured policy/asset fingerprint combination will be assigned the role <@&{{tokenRole.roleId}}>. A token will be considered if one of the added metadata filters matches.",
				"tokenRoleDetailsWithFiltersAllMatched": "All verified users that own at least one token corresponding to each added metadata filter will be assigned the role <@&{{tokenRole.roleId}}>. Tokens will be considered for one or more filters. All configured policies will be considered.",
				"tokenRoleDetailsShortSelect": "Role <@&{{tokenRole.roleId}}> - Select below for more info.",
				"withStakingProvider": "\nℹ Tokens that are staked with **{{stakingProviderName}}** will also be included in the assets owned by each member.",
				"maximumInfo": " and at most {{tokenRole.maximumTokenQuantity}}",
				"chooseDetails": "Choose the token role you want to get details for",
				"chooseText": "Role-ID: {{tokenRole.id}}",
				"noPremium": "🙀 Users currently only get the token role with the lowest ID automatically assigned (Role-ID: {{tokenRole.id}}), as your server is not running **Black Edition**. All other automatic role changes are suspended. Please run **/configure-premium status** to check your Black Edition status.",
				"errorNotFound": "⚠ No token role with the ID **{{tokenRoleId}}** was found for this server."
			},
			"details": {
				"purpose": "Here are the details on the given token role you have requested."
			},
			"metadatafilter": {
				"add": {
					"metadataFiltersTitle": "**Active Filters**",
					"metadataFiltersContent": "Attribute *{{{filter.attributeName}}}* {{operatorText}} \"{{{attributeValue}}}\"",
					"metadataFiltersContentTokenWeight": "Attribute *{{{filter.attributeName}}}* {{operatorText}} \"{{{attributeValue}}}\" will have a weight of {{tokenWeight}}",
					"metadataOperator-EQUALS": "is",
					"metadataOperator-NOTEQUALS": "is not",
					"metadataOperator-CONTAINS": "contains the text",
					"metadataOperator-NOTCONTAINS": "does not contain the text",
					"metadataOperator-STARTSWITH": "starts with the text",
					"metadataOperator-ENDSWITH": "ends with the text",
					"metadataOperator-REGEX": "matches the Regular Expression",
					"metadataFilterJoinPhraseAnd": " **AND** ",
					"metadataFilterJoinPhraseOr": " **OR** ",
					"metadataFilterJoinPhraseOneEach": " **AND A DIFFERENT TOKEN MATCHING** ",
					"metadataFilterJoinPhraseAllMatch": " **AND A TOKEN MATCHING** ",
					"errorLimitReached": "⚠ You cannot add more than three metadata filters to any token role. Please get in touch with us to request more filters for your token roles.",
					"errorAttributeValueLength": "⚠ You cannot use attribute values with more than {{maxLength}} characters.",
					"errorAttributeNameLength": "⚠ You cannot use attribute names with more than {{maxLength}} characters."
				},
				"remove": {
					"purpose": "Choose the metadata filter you want to remove from this role.",
					"valueRepeat": "Value: {{{attributeValue}}}",
					"errorNoFiltersTitle": "No filters found",
					"errorNoFilters": "⚠ No metadata filters are active for this token role - nothing to remove.",
					"chooseRemove": "Choose the metadata filter to remove",
					"success": "🗑️ Removed the metadata filter from this token role. The remaining details are as follows:"
				}
			},
			"policies": {
				"add": {
					"policiesTitle": "**Accepted Policies**",
					"policiesContentEntry": "• {{policyId}} {{{fingerprintInfo}}}",
					"policiesContentAndMore": "• and {{additionalPolicyCount}} more...",
					"policiesContent": "{{policyId}} {{{fingerprintInfo}}}",
					"fingerprintInfo": "with the asset fingerprint *{{assetFingerprint}}* ",
					"fingerprintInfoShort": " ({{assetFingerprint}})",
					"errorLimitReached": "⚠ You cannot add more than fifty policies to any token role.",
					"errorAlreadyUsed": "⚠ The policy ID/asset fingerprint combination {{policyId}} {{{fingerprintInfo}}} is already assigned to the token role with ID {{tokenRole.id}}."
				},
				"remove": {
					"purpose": "Choose the policy/asset you want to remove from this role.",
					"errorLastPolicyTitle": "One policy required",
					"errorLastPolicy": "⚠ You cannot remove the last accepted policy/asset combination for this role.",
					"chooseRemove": "Choose the policy/asset combination to remove",
					"success": "🗑️ Removed the selected policy/asset combination from this token role. The remaining details are as follows:"
				}
			},
			"add": {
				"success": "✅ New automatic role-assignment for the following token owners added to this server:",
				"errorMinimumTokens": "⚠ Automatic token role-assignment could not be added, as minimum token count needs to be at least 1.",
				"errorMaximumTokens": "⚠ Automatic token role-assignment could not be added, as maximum token count needs to be at least 1 and cannot be less than minimum token count.",
				"errorAssetFingerprint": "⚠ Automatic token role-assignment could not be added, since the provided asset fingerprint did not match the required format. Asset fingerprints look as follows: *asset1acqu7skxpaj2k5kgnvpk96yclag4nfw48zkpek*.",
				"errorPolicyId": "⚠ Automatic token role-assignment could not be added, since the provided policy ID did not match the required format. Policy IDs look as follows: *8f63e08467bfbbc260a382a80f3297f9a569fca0293f296620d72d17*.",
				"errorLimitReached": "⚠ You have reached the maximum number of **{{maxTokenRoles}}** allowed token roles for your server. This limit is enforced to prevent extensive resource usage by individual Discord servers. Please get in touch with us if you have special requirements for more token roles.",
				"roleInUseWarning": "⚠ WARNING - ROLE IN USE",
				"roleInUseDetails": "The role <@&{{roleId}}> is currently assigned to {{memberCount}} members on this Discord server. If you continue, the bot will regularly remove every user from this role unless they are verified and have fulfilled the token ownership requirements you are configuring.\n\nPlease confirm, if you want to proceed regardless.\n\n💡 Do NOT make token role assignments with roles that are assigned by other bots. The bots will \"battle\" to assign and unassign, otherwise.",
				"confirmRole": "I understand - continue",
				"canceled": "ℹ Adding the following token role was cancelled:\n\nRole <@&{{roleId}}>\nPolicy ID: {{policyId}}\nMinimum token amount: {{minimumTokenQuantity}}",
				"noPremium": "🙀 You currently can not add any additional token roles as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status.",
				"nextStepsTitle": "💡 Next steps",
				"nextStepsDetails": "Are you looking to set rules based on your token metadata or advanced weighting and aggregation methods? Find examples on what is possible in the documentation at https://www.hazelnet.io/documentation/configure-tokenroles-update and https://www.hazelnet.io/documentation/configure-tokenroles-metadatafilter-add\n\nHave fun experimenting!"
			},
			"update": {
				"success": "✅ Automatic token role-assignment was successfully updated:",
				"canceled": "ℹ Updating the token role was cancelled."
			},
			"remove": {
				"success": "🗑️ Removed the following token role auto-assignment from this server:",
				"errorNotFound": "⚠ No token role with the ID **{{tokenRoleId}}** was found for this server. Nothing was removed."
			},
			"test": {
				"purpose": "The user <@{{user.id}}> is eligible for the following token roles on this Discord server:\n\n{{{roleData}}}",
				"roleEntry": "   • <@&{{roleId}}>",
				"roleEntryNoneEligible": "ℹ The user is not eligible for any roles. If you feel roles are missing, check your token role configuration and have them confirm their verified wallets and content.",
				"notLinkedError": "🔌 The user is not linked to your Discord server. If they are wanting to get roles assigned, they will have to link their existing verifications to this server via **/verify link** or verify at least one wallet address successfully via **/verify add**.",
				"blacklistedError": "🛑 The user is currently banned from any use of the Discord server service. Please contact your support team for further details.",
				"noMissingRolesTitle": "No missing roles",
				"noMissingRoles": "✅ The user is not currently missing any roles that should be assigned to them.",
				"missingRolesTitle": "Missing roles",
				"missingRoles": "⚠ The user is currently not assigned the following roles that they are eligible for:\n\n{{{roleData}}}\n\n💡 They can either run **/verify unlink** and immediately **/verify link** once a day to get their roles assigned, or wait for up to two hours for automatic assignments to kick in. Alternatively, click the button below to assign their roles (be warned that this will make it you will be asked to do this for your end users manually constantly).",
				"assignRoles": "Assign missing roles",
				"queueSuccess": "✅ Successfully queued role assignments for the user. Their roles should appear within the next minutes."
			}
		},
		"delegatorroles": {
			"list": {
				"purpose": "This is the list of Discord roles that will be automatically assigned, based on delegated ADA amounts and stakepools for verified users.",
				"noDelegatorRolesTitle": "No delegator roles",
				"noDelegatorRolesDetail": "*Currently, this server has no delegation-based roles configured.*",
				"stakepoolNameOfficial": "Stakepool {{{officialStakepool.info.ticker}}}, {{officialStakepool.poolHash}} (Role-ID: {{delegatorRole.id}})",
				"stakepoolNameAny": "Any official stakepool of this server (see list via /info) (Role-ID: {{delegatorRole.id}})",
				"stakepoolNameInofficial": "{{delegatorRole.poolHash}} (Role-ID: {{delegatorRole.id}})",
				"delegatorRoleDetails": "All verified users that delegate at least **₳{{minimumStake}}** to the above pool will be assigned the role <@&{{delegatorRole.roleId}}>.",
				"noPremium": "🙀 Users currently only get the delegator role with the lowest ID automatically assigned (Role-ID: {{delegatorRole.id}}), as your server is not running **Black Edition**. All other automatic role changes are suspended. Please run **/configure-premium status** to check your Black Edition status."
			},
			"add": {
				"success": "✅ New automatic role-assignment for the following delegators added to this server:",
				"errorMinimumStake": "⚠ Automatic delegator role-assignment could not be added, as minimum stake amount needs to be at least 1₳.",
				"roleInUseWarning": "⚠ WARNING - ROLE IN USE",
				"roleInUseDetails": "The role <@&{{roleId}}> is currently assigned to {{memberCount}} members on this Discord server. If you continue, the bot will regularly remove every user from this role unless they are verified and have fulfilled the delegation requirements you are configuring.\n\nPlease confirm, if you want to proceed regardless.\n\n💡 Do NOT make delegator role assignments with roles that are assigned by other bots. The bots will \"battle\" to assign and unassign, otherwise.",
				"confirmRole": "I understand - continue",
				"canceled": "ℹ Adding the following delegator role was cancelled:\n\nRole <@&{{roleId}}>\nPool hash: {{poolHash}}\nMinimum staked ADA: {{minimumStakeAda}}",
				"noPremium": "🙀 You currently can not add any additional delegator roles as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status.",
				"noMatchingStakepool": "⚠ The pool hash *{{poolHash}}* you have provided is not included in your list of supported stakepools on this server. Make sure it is added via **/configure-stakepool add** or verify the right pool hash via **/configure-stakepool list**.",
				"noStakepools": "⚠ You have to add at least one supported stake pool to your server via the **/configure-stakepool add** command, to be able to add a delegator role."
			},
			"remove": {
				"success": "🗑️ Removed the following delegator role auto-assignment from this server:",
				"errorNotFound": "⚠ No delegator role with the ID **{{delegatorRoleId}}** was found for this server. Nothing was removed."
			},
			"test": {
				"purpose": "The user <@{{user.id}}> is eligible for the following delegator roles on this Discord server:\n\n{{{roleData}}}",
				"roleEntry": "   • <@&{{roleId}}>",
				"roleEntryNoneEligible": "ℹ The user is not eligible for any roles. If you feel roles are missing, check your delegator role configuration and have them confirm their verified wallets and delegated amounts.",
				"notLinkedError": "🔌 The user is not linked to your Discord server. If they are wanting to get roles assigned, they will have to link their existing verifications to this server via **/verify link** or verify at least one wallet address successfully via **/verify add**.",
				"blacklistedError": "🛑 The user is currently banned from any use of the Discord server service. Please contact your support team for further details.",
				"noMissingRolesTitle": "No missing roles",
				"noMissingRoles": "✅ The user is not currently missing any roles that should be assigned to them.",
				"missingRolesTitle": "Missing roles",
				"missingRoles": "⚠ The user is currently not assigned the following roles that they are eligible for:\n\n{{{roleData}}}\n\n💡 They can either run **/verify unlink** and immediately **/verify link** once a day to get their roles assigned, or wait for up to two hours for automatic assignments to kick in. Alternatively, click the button below to assign their roles (be warned that this will make it you will be asked to do this for your end users manually constantly).",
				"assignRoles": "Assign missing roles",
				"queueSuccess": "✅ Successfully queued role assignments for the user. Their roles should appear within the next minutes."
			}
		},
		"poll": {
			"list": {
				"purpose": "This is the list of all existing polls for this Discord server.",
				"noPollsDetail": "*There are no configured polls on this server.*",
				"pollInfo": "Opens on: <t:{{openAfterTimestamp}}>\nCloses on: <t:{{openUntilTimestamp}}>\n{{{resultsVisible}}}",
				"pollInfoVoteaire": "Opens on: <t:{{openAfterTimestamp}}>\nCloses on: <t:{{openUntilTimestamp}}>\n[Voteaire ID {{voteaireUUID}}]({{{voteaireLink}}})",
				"choosePollDetails": "Choose the poll you want more details on",
				"details": "Poll Details",
				"detailsName": "Display name (Internal name)",
				"detailsDescription": "Description/Question",
				"detailsDescriptionEmpty": "N/A",
				"detailsCreation": "Created at",
				"creationDate": "<t:{{createTime}}>",
				"detailsDates": "Opens/Closes",
				"detailsChoices": "Poll voting choices",
				"detailsVoteaireLink": "Link to on-chain ballot",
				"detailsConfiguration": "Poll configuration",
				"optionList": "Public results: {{resultsVisible}}\nMultiple options allowed: {{multipleVotes}}\nToken-based vote: {{tokenBased}}\nWeighted vote: {{weighted}}",
				"detailsRoles": "User has to have one of the following roles",
				"requiredRoleEntry": "• <@&{{role.roleId}}>",
				"detailsChannel": "Announcement info",
				"announcementNone": "No voting announcement will be made by the bot and the results will not be automatically published when the vote ends.",
				"announcementChannel": "A voting announcement with info on how to vote will be posted in <#{{poll.channelId}}> when the poll opens.",
				"adminName": "{{{poll.displayName}}} ({{poll.name}})",
				"noPremium": "🙀 Users currently can not vote in or view any polls as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
			},
			"add": {
				"previewPhase1": "Welcome to the new poll wizard 🧙‍♂️! We will walk you through creating a new poll for your server.\n⚠ We highly suggest only running this command in a private channel as you will be asked to type messages to populate the description and voting options later on.\n\nYou've configured the following initial settings for your poll:",
				"previewPhase1Details": "**Internal name**: {{name}}\n**Display name**: {{displayName}}\n**Poll open time**: Users will be able to start voting at {{pollOpenTime}} UTC\n**Poll close time**: Users can vote until {{pollCloseTime}} UTC",
				"previewPhase1NoChannel": "You have not selected a channel for the bot to post a voting announcement in at poll open time.",
				"previewPhase1Channel": "The bot will post a voting announcement in <#{{publishChannel}}> once the poll opens.",
				"previewPhase1NoRequiredRole": "No role requirements are in effect - everybody will be able to see the poll.",
				"previewPhase1RequiredRole": "To view and participate in the vote, users will need to be assigned the <@&{{requiredRole}}> role. You can additional roles via the */configure-poll update* command later.",
				"previewPhase1NextSteps": "❗ Please send a message to this current channel (<#{{currentChannel}}>) in the next 5 minutes, containing the description for your poll that you would like to use:",
				"startPhase3": "Use this description",
				"redoPhase2": "Change description",
				"previewPhase2Description": "**Poll Description/Question**:\n{{{description}}}",
				"previewPhase3NextSteps": "❗ Please send up to ten messages to this current channel (<#{{currentChannel}}>) containing your voting options and add a reaction with your desired emote to each message:",
				"previewPhase3Options": "**Vote options**:\n{{{options}}}",
				"startPhase4": "Use these options",
				"redoPhase3": "Reset all options",
				"previewPhase4NextSteps": "❗ Please select some final settings for your poll. If you choose token ownership to be required, a final step will ask you for information about the voting snapshot",
				"isPublicVote": "Are results publicly viewable before the vote ends?",
				"publicVoteYes": "Public Vote",
				"publicVoteYesDescription": "Voting results are publicly visible via /vote",
				"publicVoteNo": "Hidden Results",
				"publicVoteNoDescription": "Voting results are hidden until manually published",
				"isMultipleVotes": "Can users vote for more than one option at once?",
				"multipleVoteYes": "Multiple votes",
				"multipleVoteYesDescription": "Users can select multiple voting options",
				"multipleVoteNo": "One Choice",
				"multipleVoteNoDescription": "Users can only select one choice",
				"isTokenOwnershipRequired": "Can only token holders vote in this poll?",
				"tokenTypeNone": "Everyone",
				"tokenTypeHolderOnly": "Holders",
				"tokenTypeHolderWeighted": "Weighted",
				"tokenTypeNoneDescription": "No, anyone can",
				"tokenTypeHolderOnlyDescription": "Yes, each holder gets one vote",
				"tokenTypeHolderWeightedDescription": "Yes, holders get votes based on owned number of tokens",
				"startPhase5": "Provide token details",
				"previewPhase5NextStepsPolicyIdOnly": "Only people that are verified owners of tokens from the policy *{{policyId}}* can vote.",
				"previewPhase5NextStepsPolicyIdAndFingerprint": "Only people that are verified owners of tokens from the policy *{{policyId}}* with the asset fingerprint *{{assetFingerprint}}* can vote.\n⚠ The ownership snapshot will be made in the next ten minutes after this poll is created.",
				"previewPhase5NextStepsWeighted": "The voting power will be based on the amount of tokens. If multiple selections can be made, the total voting power will be evenly distributed across all choices (rounded down).",
				"previewPhase5NextSteps": "❗ Please enter the policy ID of the token that voters will be voting with. If using fungible tokens, we also recommend to provide the asset fingerprint, separated with a plus from the policy ID, as follows: *489aa3378d13c87ad4e595ab2a9092e9c92bd645b725b853a3cdebf3+asset1acqu7skxpaj2k5kgnvpk96yclag4nfw48zkpek*",
				"redoPhase5": "Change token data",
				"finish": "Create poll",
				"success": "✅ New poll with the following settings added to this server:",
				"errorTimeout": "The poll wizard 🧙‍♂️ timed out waiting for your input, sorry. Please restart the wizard via the */configure-poll add* command.",
				"errorPolicyFormat": "The format of either the policy ID, the asset fingerprint, or both are incorrect.\nValid policy IDs have 56 alphanumberic characters.\nAsset fingerprints look as follows: *asset1acqu7skxpaj2k5kgnvpk96yclag4nfw48zkpek*",
				"pollEndDateInPast": "⚠ Could not add poll because the close time <t:{{pollCloseTimestamp}}> is in the past.",
				"pollNameInUse": "⚠ Could not add poll because the name \"{{pollName}}\" is already in use by another poll.",
				"invalidName": "⚠ Could not add poll because the name \"{{pollName}}\" was invalid. While the display name can be any text, the internal name needs to be start with a letter and can only contain letters and numbers, no whitespaces or special characters, and 30 characters or less.",
				"noPremium": "🙀 You currently can not add any polls as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
			},
			"add-onchain": {
				"success": "✅ Successfully added Voteaire poll with ballot ID **{{poll.voteaireUUID}}**. The following ballot data was retrieved:"
			},
			"announce": {
				"purpose": "👇 Pick a poll from the list of available polls to announce. If the poll is still open, a vote button will also be added to the widget.\n\n{{{resultsPublishingInfo}}}\n\n💡 You can only have one announcement for each poll at a time. The announcement will automatically be updated with the current results every 5 minutes if your poll has public results.",
				"resultsPublishYes": "📢 The (current) results will be published along with the poll announcement.",
				"resultsPublishMaybe": "🔐 The results will remain hidden for non-public polls until you explicit publish them via **/configure-poll announce** with the *publishresults* parameter set to *True*.",
				"success": "✅ Results successfully published in <#{{channel}}>.",
				"publicSuccess": "🗳 The team shared the following poll with you.",
				"choosePoll": "Pick the poll you'd like to announce the results for",
				"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages** and **Embed Links** permissions for the bot to allow announcing in it.",
				"errorWrongChannelType": "This channel cannot be used for poll announcements."
			},
			"remove": {
				"success": "🗑️ Removed the following poll from this server:",
				"purpose": "Select the poll to remove from your Discord server.\n\n⚠ **ALL REGISTERED VOTES WILL BE REMOVED AND BECOME INACCESSIBLE FOR YOU, IF YOU REMOVE THE POLL**.\n\nOnly do this after you have processed this poll.",
				"errorNotFound": "⚠ No poll with the ID **{{pollId}}** was found for this server. Nothing was removed.",
				"choosePollDetails": "Choose the poll you want to irrevocably delete"
			},
			"update": {
				"addrole": {
					"success": "✅ The role <@&{{roleId}}> was successfully added as an eligible role to vote in the poll **{{poll.displayName}}**.",
					"purpose": "Select the poll you would like the role <@&{{roleId}}> to be able to vote in.\n\n💡 All other requirements, like poll times and holding any tokens from related snapshot, remain in place in addition to the existing role requirements.",
					"choosePoll": "Choose the poll you want to allow this role to vote in",
					"tooManyRoles": "⚠ Cannot add more than 20 roles to a poll.",
					"roleExists": "⚠ The role <@&{{roleId}}> is already allowed to vote in this poll and was not added again."
				},
				"removerole": {
					"success": "🗑️ The role <@&{{roleId}}> was successfully removed from being eligible to vote on the poll **{{poll.displayName}}**.",
					"purpose": "Select the poll you would like to remove a role from being allowed to vote in.\n\n💡 All other requirements, like poll times and holding any tokens from related snapshot, remain in place in addition to the existing role requirements.",
					"choosePoll": "Choose the poll you want to remove this role from",
					"chooseRolePurpose": "Choose which role you would like to remove from the poll {{displayName}}:",
					"chooseRole": "Choose role to remove",
					"noRoles": "⚠ No roles to remove exist on this poll."
				}
			}
		},
		"whitelist": {
			"list": {
				"purpose": "This is the list of all existing whitelists for this Discord server.",
				"noWhitelistsDetail": "*There are no configured whitelists on this server.*",
				"adminName": "{{{whitelist.displayName}}} (API name: {{whitelist.name}})",
				"noPremium": "🙀 Users currently can not register for any whitelists as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status.",
				"sharedWhitelists": "🤝 Whitelists shared with you",
				"sharedWhitelistsDetail": "Here are all the whitelists other servers have shared with you. You can download the signups for these lists via the **/configure-whitelist download** command.",
				"sharedWhitelistsEntry": "• **{{{whitelistDisplayName}}}** on Discord *{{{guildName}}}*."
			},
			"add": {
				"success": "✅ New whitelist with the following requirements added to this server:",
				"alreadyExists": "⚠ A whitelist with the name \"{{whitelistName}}\" already exists. Please choose a different internal name.",
				"invalidName": "⚠ Could not add whitelist because the name \"{{whitelistName}}\" was invalid. While the display name can be any text, the internal name needs to be start with a letter and can only contain letters and numbers, no whitespaces or special characters, and 30 characters or less.",
				"noPremium": "🙀 You currently can not add any whitelists as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
			},
			"update": {
				"details": {
					"success": "✅ Whitelist **{{{whitelist.displayName}}}** (API name: {{whitelist.name}}) was successfully updated:",
					"notFound": "⚠ No whitelist with API name **{{whitelistName}}** found. Use **/configure-whitelist list** to see your available API names."
				},
				"addrole": {
					"success": "✅ The role <@&{{roleId}}> was successfully added as an eligible role to register for the whitelist **{{whitelist.displayName}}**.",
					"purpose": "Select the whitelist you would like the role <@&{{roleId}}> to be able to register for.\n\n💡 All other requirements, like signup times and maximum counts, remain in place in addition to the existing role requirements.",
					"chooseWhitelist": "Choose the whitelist you want to allow this role to vote in",
					"tooManyRoles": "⚠ Cannot add more than 20 roles to a whitelist.",
					"roleExists": "⚠ The role <@&{{roleId}}> is already allowed to register for this whitelist and was not added again."
				},
				"removerole": {
					"success": "🗑️ The role <@&{{roleId}}> was successfully removed from being eligible to register for the whitelist **{{whitelist.displayName}}**.",
					"purpose": "Select the whitelist you would like to remove a role from being able to register for.\n\n💡 All other requirements, like signup times and maximum counts, remain in place in addition to the existing role requirements.",
					"chooseWhitelist": "Choose the whitelist you want to remove this role from",
					"chooseRolePurpose": "Choose which role you would like to remove from the whitelist {{displayName}}:",
					"chooseRole": "Choose role to remove",
					"noRoles": "⚠ No roles to remove exist on this whitelist."
				}
			},
			"close": {
				"purpose": "Close registrations for this whitelist, either permanently or temporarily. You can close lists before they reach their end times or max user counts with this command. You can reopen it later via */configure-whitelist open*.",
				"success": "🔒 The whitelist {{whitelist.displayName}} ({{whitelist.name}}) was successfully closed! If you want to reopen it later, use */configure-whitelist open*.",
				"noWhitelistsDetail": "⚠ There are currently no open whitelists on this server that can be closed.",
				"otherError": "⚠ Error while closing this whitelist."
			},
			"open": {
				"purpose": "Reopen registrations for this whitelist. Users will be able to register if the signup window has not yet closed and they fulfill all other conditions.",
				"success": "🔓 The whitelist {{whitelist.displayName}} ({{whitelist.name}}) was successfully reopened! If you want to close it again later, use */configure-whitelist close*.",
				"noWhitelistsDetail": "⚠ There are currently no closed whitelists on this server that can be opened.",
				"otherError": "⚠ Error while opening this whitelist."
			},
			"announce": {
				"purpose": "Select the whitelist you would like to announce. The announcement will include the name of the whitelist and enable users to sign up or see their signup status with buttons directly on the whitelist announcement.",
				"success": "✅ Whitelist successfully announced in <#{{channel}}>.",
				"publicSuccessTitle": "📢 Whitelist opportunity!",
				"publicSuccess": "The following whitelist is available to this community. If you fulfill the conditions, register one of your verified addresses via the button below or verify your wallet first and then register!",
				"publicSuccessNoAddress": "The following whitelist is available to this community. If you fulfill the conditions, register via the button below!",
				"detailsDescription": "Whitelist details",
				"noWhitelistsDetail": "⚠ There are currently no open whitelists on this server that can be announced.",
				"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages** and **Embed Links** permissions for the bot to allow announcing in it.",
				"errorWrongChannelType": "This channel cannot be used for whitelist announcements."
			},
			"share": {
				"purpose": "You are about to share the registrations of a whitelist with another HAZELnet server named **{{{discordServerToShareWith.guildName}}}**. The respective server will be able to collect whitelist registrations made on your server without needing access to your API key. You can unshare at any time with **/configure-whitelist unshare**.\n\nSelect the whitelist you would like to share.",
				"success": "🤝 The whitelist {{whitelist.displayName}} ({{whitelist.name}}) was successfully shared with **{{{discordServerToShareWith.guildName}}}**! If you want to unshare it again later, use */configure-whitelist unshare*.",
				"noWhitelistsDetail": "⚠ There are currently no whitelists on this server that can be shared.",
				"errorShareWithSelf": "⚠ You cannot share whitelists with your own Discord server.",
				"errorGuildNotFound": "⚠ The guild with the ID {{guildToShareWith}} you are trying to share your whitelist with, does not exist or is not using the HAZELnet bot.",
				"otherError": "⚠ Error while sharing this whitelist."
			},
			"unshare": {
				"purpose": "You are about to disable sharing the registrations of a whitelist with another HAZELnet server. The respective server will no longer be able to collect whitelist registrations made on your server.",
				"success": "🔌 The whitelist {{whitelist.displayName}} ({{whitelist.name}}) was successfully unshared with **{{discordServerToUnshareWith.guildName}}**!",
				"selectServer": "{{{whitelist.displayName}}} (shared with {{{guildName}}})",
				"noWhitelistsDetail": "⚠ There are currently no shared whitelists on this server.",
				"otherError": "⚠ Error while unsharing this whitelist."
			},
			"download": {
				"purpose": "Select which whitelist you would like to download the address data for",
				"success": "📂 Here is the download with address data for the whitelist **{{whitelist.displayName}}**. Thank you for using HAZELnet.",
				"successExternal": "📂 Here is the download with address data for the whitelist **{{{whitelistDisplayName}}}** from Discord server *{{{guildName}}}*. Thank you for using HAZELnet.",
				"errorSignupsEmpty": "⚠ No download is available for the whitelist **{{whitelist.displayName}}**. No one has signed up, yet.",
				"otherError": "⚠ Error while downloading this whitelist.",
				"externalWhitelist": "{{{whitelistDisplayName}}} ({{{guildName}}})",
				"errorNotFound": "⚠ No whitelist with the name **{{whitelistName}}** was found for this server. Nothing was removed."
			},
			"remove": {
				"success": "🗑️ Removed the following whitelist from this server:",
				"purpose": "Select the whitelist to remove from your Discord server.\n\n⚠ **ALL REGISTERED ADDRESSES WILL BE REMOVED AND BECOME INACCESSIBLE FOR YOU, IF YOU REMOVE THE WHITELIST**.\n\nOnly do this after you have processed this whitelist for minting/distribution etc.",
				"errorNotFound": "⚠ No whitelist with the name **{{whitelistName}}** was found for this server. Nothing was removed.",
				"otherError": "⚠ Error while removing this whitelist."
			}
		},
		"marketplace": {
			"general": {
				"viewOnMarketplace": "View on marketplace",
				"viewOnPixlPage": "View on pixl.page",
				"viewOnCnftJungle": "View on cnftjungle.io",
				"viewOnPoolPm": "View on pool.pm"
			},
			"sales": {
				"add": {
					"purpose": "You are about to add a sales tracker for a project. Announcements for any sales from **{{marketplaceNames}}** will be posted in <#{{channel}}>.\n\nℹ Select the project you want to track below. If your project is missing, make sure to add it via **/configure-policy add**. If you have more than 25 official policies on this server, you can use the optional policy-id parameter on this command to select the project directly.",
					"minimumPriceAddon": " Only sales above or equal to the price of **₳{{minimumPriceAda}}** will be announced.",
					"maximumPriceAddon": " Only sales below or equal the price of **₳{{maximumPriceAda}}** will be announced.",
					"chooseProject": "Select project/policy",
					"policyId": "Policy ID: {{policyId}}",
					"success": "A sales tracker for the project **{{projectName}}** has been added! Announcements for any sales from **{{marketplaceNames}}** will be posted in <#{{channel}}>.",
					"noPoliciesDetail": "*This server has no official projects added and cannot track any sales.*\nℹ Make sure to run **/configure-policy add** to add official projects to your Discord before running this command.",
					"noProjectFound": "⚠ No project with the given policy ID was found.\nℹ Make sure to run **/configure-policy add** to add official projects to your Discord before running this command.",
					"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages**, **Embed Links** and **Attach Files** permissions for the bot to allow announcing in it.",
					"errorWrongChannelType": "This channel cannot be used for sales announcements.",
					"errorLimitReached": "⚠ You cannot add more than {{maxCount}} sales trackers to your server.",
					"otherError": "⚠ Error while adding a sales tracking channel.",
					"errorMinimumValue": "⚠ Please use a minimum value of at least 1 ADA.",
					"noPremium": "🙀 You currently can not add any sales trackers as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
				},
				"list": {
					"purpose": "Show the list of all active sales trackers in this Discord server.",
					"entryTitle": "Project \"{{{projectName}}}\" (Tracker-ID: {{marketplaceChannel.id}})",
					"entry": "Announcements for sales on **{{marketplaceNames}}** will be posted in <#{{channel}}>.",
					"filterActive": "Only sales for assets that match the following metadata filters will be announced:",
					"noMarketplaceChannels": "*There are no configured sales trackers on this server.*"
				},
				"announce": {
					"title": "New sale!",
					"itemContentBuy": "**{{displayName}}** just sold!",
					"itemContentOffer": "**{{displayName}}** just sold for an offer!",
					"rank": "Asset rank",
					"rankContent": "Rank #{{rank}}",
					"marketplace": "Sold on Marketplace",
					"soldFor": "Sold for",
					"offerPrice": "Offer price",
					"soldForContent": "{{price}} ADA"
				},
				"remove": {
					"purpose": "Remove a sales tracker from your Discord server by selecting it in the below dropdown.",
					"success": "🗑️ Removed the following sales tracker from this server:",
					"deleted": "Announcements for sales on **{{marketplaceNames}}** will no longer be posted in <#{{channel}}>.",
					"chooseMarketplaceChannel": "Choose a sales tracker",
					"entryTitle": "Project \"{{{projectName}}}\" (Tracker-ID: {{marketplaceChannel.id}})",
					"entry": "{{marketplaceNames}}, #{{channelName}}",
					"entryAddon": ", >= ₳{{minimumPriceAda}}",
					"minimumPriceAddon": "This affects any sales with a minimum price of **₳{{minimumPriceAda}}**",
					"maximumPriceAddon": "This affects any sales with a maximum price of **₳{{maximumPriceAda}}**",
					"deletedChannel": "deleted",
					"otherError": "⚠ Error while removing a sales tracking channel."
				}
			},
			"listings": {
				"add": {
					"purpose": "You are about to add a listings tracker for a project. Announcements for listings on **{{marketplaceNames}}** will be posted in <#{{channel}}>.\n\nℹ Select the project you want to track below. If your project is missing, make sure to add it via **/configure-policy add**. If you have more than 25 official policies on this server, you can use the optional policy-id parameter on this command to select the project directly.",
					"minimumPriceAddon": " Only listings above or equal to the asking price of **₳{{minimumPriceAda}}** will be announced.",
					"maximumPriceAddon": " Only listings below or equal to the asking price of **₳{{maximumPriceAda}}** will be announced.",
					"chooseProject": "Select project/policy",
					"policyId": "Policy ID: {{policyId}}",
					"success": "A listings tracker for the project **{{projectName}}** has been added! Announcements for listings from **{{marketplaceNames}}** will be posted in <#{{channel}}>.",
					"noPoliciesDetail": "*This server has no official projects added and cannot track any listings.*\nℹ Make sure to run **/configure-policy add** to add official projects to your Discord before running this command.",
					"noProjectFound": "⚠ No project with the given policy ID was found.\nℹ Make sure to run **/configure-policy add** to add official projects to your Discord before running this command.",
					"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages**, **Embed Links** and **Attach Files** permissions for the bot to allow announcing in it.",
					"errorWrongChannelType": "This channel cannot be used for listing announcements.",
					"errorLimitReached": "⚠ You cannot add more than {{maxCount}} listing trackers to your server.",
					"errorMinimumValue": "⚠ Please use a minimum value of at least 1 ADA.",
					"otherError": "⚠ Error while adding a listing tracking channel.",
					"noPremium": "🙀 You currently can not add any listing trackers as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
				},
				"list": {
					"purpose": "Show the list of all active listing trackers in this Discord server.",
					"entryTitle": "Project \"{{{projectName}}}\" (Tracker-ID: {{marketplaceChannel.id}})",
					"entry": "Announcements for listings on **{{marketplaceNames}}** will be posted in <#{{channel}}>.",
					"filterActive": "Only listings for assets that match the following metadata filters will be announced:",
					"noMarketplaceChannels": "*There are no configured listing trackers on this server.*"
				},
				"announce": {
					"title": "New listing!",
					"itemContentListed": "**{{displayName}}** was just listed!",
					"rank": "Asset rank",
					"rankContent": "Rank #{{rank}}",
					"marketplace": "Listed on Marketplace",
					"listedFor": "Listed for",
					"listedForContent": "{{price}} ADA"
				},
				"remove": {
					"purpose": "Remove a listing tracker from your Discord server by selecting it in the below dropdown.",
					"success": "🗑️ Removed the following listing tracker from this server:",
					"deleted": "Announcements for listings on **{{marketplaceNames}}** will no longer be posted in <#{{channel}}>.",
					"chooseMarketplaceChannel": "Choose a listing tracker",
					"entryTitle": "Project \"{{{projectName}}}\" (Tracker-ID: {{marketplaceChannel.id}})",
					"entry": "{{marketplaceNames}}, #{{channelName}}",
					"entryAddon": ", >= ₳{{minimumPriceAda}}",
					"minimumPriceAddon": "This affects any listings with a minimum asking price of **₳{{minimumPriceAda}}**",
					"maximumPriceAddon": "This affects any listings with a maximum asking price of **₳{{maximumPriceAda}}**",
					"deletedChannel": "deleted",
					"otherError": "⚠ Error while removing a listing tracking channel."
				}
			},
			"mint": {
				"add": {
					"purpose": "You are about to add a mint tracker for a project. Announcements for mints of the project's policy will be posted in <#{{channel}}>.\n\nℹ Select the project you want to track below. If your project is missing, make sure to add it via **/configure-policy add**. If you have more than 25 official policies on this server, you can use the optional policy-id parameter on this command to select the project directly.",
					"chooseProject": "Select project/policy",
					"policyId": "Policy ID: {{policyId}}",
					"success": "A mint tracker for the project **{{projectName}}** has been added! Announcements for mints of the projects policy will be posted in <#{{channel}}>.",
					"noPoliciesDetail": "*This server has no official projects added and cannot track any mints.*\nℹ Make sure to run **/configure-policy add** to add official projects to your Discord before running this command.",
					"noProjectFound": "⚠ No project with the given policy ID was found.\nℹ Make sure to run **/configure-policy add** to add official projects to your Discord before running this command.",
					"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages**, **Embed Links** and **Attach Files** permissions for the bot to allow announcing in it.",
					"errorWrongChannelType": "This channel cannot be used for mint announcements.",
					"errorLimitReached": "⚠ You cannot add more than {{maxCount}} mint trackers to your server.",
					"otherError": "⚠ Error while adding a mint tracking channel.",
					"noPremium": "🙀 You currently can not add any mint trackers as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
				},
				"list": {
					"purpose": "Show the list of all active mint trackers in this Discord server.",
					"entryTitle": "Project \"{{{projectName}}}\" (Tracker-ID: {{marketplaceChannel.id}})",
					"entry": "Announcements for mints of this project will be posted in <#{{channel}}>.",
					"filterActive": "Only mints for assets that match the following metadata filters will be announced:",
					"noMarketplaceChannels": "*There are no configured mint trackers on this server.*"
				},
				"announce": {
					"title": "New asset minted!",
					"itemContentMint": "**{{displayName}}** just minted!",
					"rank": "Asset rank",
					"rankContent": "Rank #{{rank}}"
				},
				"remove": {
					"purpose": "Remove a mint tracker from your Discord server by selecting it in the below dropdown.",
					"success": "🗑️ Removed the following mint tracker from this server:",
					"deleted": "Announcements for mints will no longer be posted in <#{{channel}}>.",
					"chooseMarketplaceChannel": "Choose a mint tracker",
					"entryTitle": "Project \"{{{projectName}}}\" (Tracker-ID: {{marketplaceChannel.id}})",
					"entry": "#{{channelName}}",
					"deletedChannel": "deleted",
					"otherError": "⚠ Error while removing a mint tracking channel."
				}
			},
			"metadatafilter": {
				"add": {
					"success": "✅ Successfully added a new metadata filter to the below tracker.",
					"metadataFiltersTitle": "**Active Filters**",
					"metadataFiltersContent": "Attribute *{{{filter.attributeName}}}* {{operatorText}} \"{{{attributeValue}}}\"",
					"metadataOperator-EQUALS": "is",
					"metadataOperator-NOTEQUALS": "is not",
					"metadataOperator-CONTAINS": "contains the text",
					"metadataOperator-NOTCONTAINS": "does not contain the text",
					"metadataOperator-STARTSWITH": "starts with the text",
					"metadataOperator-ENDSWITH": "ends with the text",
					"metadataOperator-REGEX": "matches the Regular Expression",
					"metadataFilterJoinPhraseAnd": " **AND** ",
					"metadataFilterJoinPhraseOr": " **OR** ",
					"errorLimitReached": "⚠ You cannot add more than ten metadata filters to any tracker. Please get in touch with us to request more filters for your trackers.",
					"errorAttributeValueLength": "⚠ You cannot use attribute values with more than {{maxLength}} characters.",
					"errorAttributeNameLength": "⚠ You cannot use attribute names with more than {{maxLength}} characters.",
					"errorNotFound": "⚠ No tracker with the ID **{{trackerId}}** was found for this server."
				},
				"remove": {
					"purpose": "Choose the metadata filter you want to remove from this tracker.",
					"valueRepeat": "Value: {{{attributeValue}}}",
					"errorNoFiltersTitle": "No filters found",
					"errorNoFilters": "⚠ No metadata filters are active for this tracker - nothing to remove.",
					"errorNotFound": "⚠ No tracker with the ID **{{trackerId}}** was found for this server.",
					"chooseRemove": "Choose the metadata filter to remove",
					"success": "🗑️ Removed the metadata filter from this tracker. The remaining details are as follows:"
				}
			}
		},
		"adminaccess": {
			"list": {
				"purpose": "This is the list of all current roles that have bot administrator status on this Discord server:",
				"administratorTitle": "Active administrator roles",
				"administratorEntry": "• <@&{{roleId}}>"
			},
			"add": {
				"success": "✅ The role <@&{{roleId}}> was successfully added as a new administrator role. The users with this role should be able to access the adminstrator commands immediately.",
				"alreadyExists": "⚠ The role <@&{{roleId}}> is already an administrator and was not added again."
			},
			"remove": {
				"success": "🗑️ Removed the administrative role <@&{{roleId}}> from this Discord server. The following roles remain administrators:",
				"notExists": "⚠ The role <@&{{roleId}}> is currently not an administrator role and was not removed.",
				"cannotRemoveLastAdminRole": "⚠ You cannot remove this administrator role because it would remove your own administrative access."
			}
		},
		"useraccess": {
			"list": {
				"purpose": "This is the list of all current roles that have basic bot usage permissions on this Discord server:",
				"userTitle": "Active user roles",
				"userEntry": "• <@&{{roleId}}>"
			},
			"add": {
				"success": "✅ The role <@&{{roleId}}> was successfully added as a new user role. The users with this role should be able to verify and access basic commands immediately.",
				"alreadyExists": "⚠ The role <@&{{roleId}}> is already an allowed user on this Discord server and was not added again."
			},
			"remove": {
				"success": "🗑️ Removed the user role <@&{{roleId}}> from this Discord server. The following roles remain users:",
				"notExists": "⚠ The role <@&{{roleId}}> is currently not a user role and was not removed.",
				"cannotRemoveLastUserRole": "⚠ The role <@&{{roleId}}> is the last user role on this server and cannot be removed."
			}
		},
		"settings": {
			"features": {
				"purpose": "Change the currently enabled feature set for the bot on this Discord server.",
				"chooseFeatures": "Choose all features you want to continue by using the below selection list:",
				"saveSettings": "Save current settings",
				"success": "✅ Your feature changes have been successfully applied! It may take a few minutes for the commands to become available."
			},
			"customize": {
				"success": "✅ The customization for your bot was updated. We're sending you a sample message for your users to see what it looks like.\n\n💡 Administrative commands starting with **/configure-** will not use custom colors or the top logo to ensure you can tell administrative commands apart from normal user commands.",
				"sampleTitle": "Sample Message",
				"sampleContent": "This is similar to what your users will see when they are running the **/info** or other public commands.",
				"invalidUrl": "⚠ You must provide a valid http or https URL to a GIF, JPG or PNG image",
				"invalidColor": "⚠ You must provide a valid RGB hex color in the format #000000 or common HTML color name like *red*, *cornflowerblue* or *greenyellow*.",
				"textTooLongTitle": "⚠ The text for author, title and footer info cannot be more than 100 characters long.",
				"textTooLongInfo": "⚠ The text for the **/info** command cannot be more than 4000 characters long.",
				"unknownElement": "Unknown customization element: {{element}}",
				"incorrectConfirmation": "⚠ To reset all customization, please type in **YES** as your customization value to confirm you want to proceed.",
				"noPremium": "🙀 You currently cannot customize your bot as you are not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
			}
		},
		"healthcheck": {
			"purpose": "With the **/configure-healthcheck** command you can test if your bot is correctly configured and has the right permissions and roles to perform its duties as expected.",
			"purposeContinued": "Health check (continued)",
			"success": "Healthy!",
			"successInfo": "✅ No problems found with your current bot configuration. You are good to go!",
			"tokenRoles": "Token role health check",
			"delegatorRoles": "Delegator role health check",
			"assignmentPermissionDenied": "⚠ The following roles cannot be auto-assigned by the bot because they are higher in the role hierarchy than the highest bot role. Go to your Discord server role list and adjust the order to fix this problem.\n\n{{{roleList}}}",
			"rolesDeleted": "⚠ You have at least one automatic role assignment set up for a deleted role. Run the respective list command to see which roles no longer exist and remove the role-assignment.",
			"deniedRoleEntry": "• <@&{{roleId}}>",
			"auditChannel": "Audit Channel health check",
			"auditChannelNotWritable": "⚠ The bot does not have permissions to send messages to your currently configured audit channel <#{{auditChannel}}>. Make sure the bot has the **View Channel**, **Send Messages** and **Embed Links** permissions on this channel.",
			"auditChannelDeleted": "⚠ Your currently configured audit channel to receive warnings about suspicious activity has been deleted. Try setting a new channel via the **/configure-protection auditchannel** command.",
			"marketplaceChannel": "Marketplace Channel health check",
			"marketplaceChannelMINT": "mint announcements",
			"marketplaceChannelSALES": "sales announcements",
			"marketplaceChannelLISTINGS": "listing announcements",
			"marketplaceChannelNotWritable": "⚠ The bot does not have permissions to send messages to your currently configured marketplace channel <#{{marketplaceChannel}}> for {{announcementType}} (Tracker-ID: {{marketplaceChannelId}}). Make sure the bot has the **View Channel**, **Send Messages**, **Embed Links** and **Attach Files** permissions on this channel.",
			"marketplaceChannelDeleted": "⚠ Your currently configured channel for {{announcementType}} (Tracker-ID: {{marketplaceChannelId}}) has been deleted. Try deleting and recreating the tracker via the **/configure-marketplace** command.",
			"blackEdition": "🐱‍👤 Black Edition health check",
			"blackEditionNotAvailable": "The following features are used beyond their free tier and only function in a limited capacity at the current time:\n\n",
			"blackEditionIssueWhitelists": "Whitelists (Black Edition required)",
			"blackEditionIssuePolls": "Polls and voting (Black Edition required)",
			"blackEditionIssueMarketplaceChannels": "Marketplace trackers (Black Edition required)",
			"blackEditionIssueTokenRoles": "Token Roles (only one available in free edition)",
			"blackEditionIssueDelegatorRoles": "Delegator Roles (only one available in free edition)",
			"blackEditionEntry": "• **{{{blackEditionIssue}}}**"
		},
		"api": {
			"generatetoken": {
				"success": "✅ A new access token was generated. Please write down this token to provide to your development team.\n❗ You will not be able to access this token again. The only way to view an access token is by generating a new one.\n\n**Your token:**\n\n*{{accessToken}}*\n\nFind the REST API documentation by downloading the current OpenAPI Swagger Documentation at the following URL: {{{externalDocumentationUrl}}}"
			},
			"removetoken": {
				"success": "🗑️ The API access token for this Discord server was successfully removed.\n❗ Any and all REST API integrations your project is using will currently not be able to retrieve data from HAZELnet."
			}
		},
		"premium": {
			"status": {
				"purpose": "Find out all you need to get your server Black Edition ready. See your last bill, current prepaid balance, monthly cost and delegation-based discounts all in one place.",
				"premiumStatus": "Current Premium Status",
				"premiumStatusNo": "Your Discord server is currently not running Black Edition.",
				"premiumStatusYes": "Your Discord server is on **Black Edition**! Thanks for supporting us 😻 Your automatic renewal will run on <t:{{premiumUntilTimestamp}}>.",
				"lastBill": "Last Bill",
				"lastBillInfo": "Your last bill with an amount of **{{lastBillingAmount}} ADA** was for {{lastBillingGuildMemberCountFormatted}} discord members and was deducted from your prepaid balance on <t:{{lastBillingTimeTimestamp}}>.",
				"cost": "Current costs",
				"costInfo": "Based on {{currentGuildMemberCountFormatted}} discord members, your monthly base cost is **{{monthlyCostFormatted}} ADA**. With your delegation discount of {{discount}}%, your current expected monthly price for Black Edition is **{{actualMonthlyCostFormatted}} ADA**.\n\n💡 Your community members can pledge support to your server via the **/premium** command, or you can stake and use the same command to pledge your stake to receive a discount or completely free Black Edition.",
				"discount": "Delegation discount",
				"discountInfo": "Your community members have currently pledged **{{totalDelegationFormatted}} ADA** out of a maximum **{{maxDelegationFormatted}} ADA**, giving you a {{discount}}% discount.",
				"balance": "Your balance",
				"balanceInfo": "Your current prepaid balance is **{{remainingBalanceFormatted}} ADA**.",
				"balanceInfoNegative": "⚠ Based on your current balance, your Black Edition will not be renewed next month. Even a 100% delegation discount will require you to at least get to **0 ADA** before renewals resume.",
				"balanceInfoTopOff": "You can refill your balance via the **/configure-premium refill** command.",
				"benefits": "Black Edition Benefits",
				"benefitsDetails": "• No advertisements for your users\n• Priority Support\n• Access to more features\n   ◦ Custom bot branding\n   ◦ Whitelists\n   ◦ Marketplace integrations\n   ◦ Holder giveaways\n   ◦ Polls and token-based voting\n   ◦ More than two token/delegator role slots\n   ◦ … and much more @ https://www.hazelnet.io/pricing"
			},
			"refill": {
				"success": "✅ You have successfully submitted a payment request to refill your balance! Please send **{{amount}} ADA** to the handle **$hazelnet** or to the address *{{incomingPayment.receivingAddress}}* by <t:{{expirationDateTimestamp}}> to refill your balance. You can use **/configure-premium status** to check if your balance has been refilled and **/configure-premium refill** again if you want to cancel the payment request.\n\n😻 Thank you for supporting HAZELnet!",
				"cancelOutstanding": "Cancel open payment request",
				"cancelSuccess": "❌ Your outstanding refill payment was successfully cancelled. You can now start a new refill process.\n\n😻 Thank you for supporting HAZELnet!",
				"errorAmountToSmall": "⚠ The submitted amount of **{{refillAmount}} ADA** is too small. The minimum refill amount is **{{minimumAmount}} ADA**.\n\n😻 Thank you for supporting HAZELnet!",
				"errorAlreadyPending": "💡 A payment has been requested already. Please send **{{amount}} ADA** to the handle **$hazelnet** or to the address *{{existingIncomingPayment.receivingAddress}}* by <t:{{expirationDateTimestamp}}> to refill your balance. You can also cancel the request below if it is not needed any more or if you want to refill a different amount. You can use **/configure-premium status** to check if your balance has been refilled.\n\n😻 Thank you for supporting HAZELnet!",
				"reminderTitle": "Black Edition Info",
				"reminder": "Hello **{{{tag}}}**!\n\n💡 As bot administrator on the Discord server *{{{guildName}}}*, we're letting you know that your Black Edition is expiring at the end of this month and there are not enough funds for a renewal.\n\nWe appreciate your support and if you would like to like to continue to benefit from multiple tokenroles, off- and on-chain polls and whitelists, marketplace integrations and giveaways, custom branding and other features, head to your server and refill via **/configure-premium refill**.\n\nHave a great day!\nYour HAZELnet team"
			}
		},
		"giveaway": {
			"list": {
				"purpose": "This is the list of all existing giveaways for this Discord server.",
				"noGiveawaysTitle": "No giveaways",
				"noGiveaways": "Currently, no available giveaways were found for this server.",
				"giveawayInfo": "Winner count: {{winnerCount}}",
				"giveawayInfoOpen": "\nOpens on: <t:{{timestamp}}>",
				"giveawayInfoClose": "\nCloses on: <t:{{timestamp}}>",
				"giveawayInfoSnapshot": "\nSnapshot on: <t:{{timestamp}}>",
				"chooseGiveawayDetails": "Choose the giveaway you want more details on",
				"details": "Giveaway Details",
				"detailsName": "Display name (Internal name)",
				"detailsDescription": "Description",
				"detailsDescriptionEmpty": "N/A",
				"detailsCreation": "Created at",
				"creationDate": "<t:{{createTime}}>",
				"detailsDates": "Starts/Ends",
				"detailsConfiguration": "Giveaway configuration",
				"optionList": "Winners must be unique: {{uniqueWinners}}\nToken-based giveaway: {{tokenBased}}\nWeighted giveaway: {{weighted}}",
				"detailsRoles": "User has to have one of the following roles",
				"requiredRoleEntry": "• <@&{{role.roleId}}>",
				"detailsChannel": "Announcement info",
				"announcementNone": "No giveaway announcement will be made by the bot and the winners will not be automatically published when the giveaway ends.",
				"announcementChannel": "A giveaway announcement with info on how to participate will be posted in <#{{giveaway.channelId}}> when the giveaway starts.",
				"adminName": "{{{giveaway.displayName}}} ({{giveaway.name}})",
				"noPremium": "🙀 Users currently can not participate in or view any giveaways as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status.",
				"winnerCountDescription": "Winner count",
				"winnerCount": "When the giveaway is closed, **{{winnerCount}} winners** will be drawn.",
				"drawTypeDescription": "Draw type",
				"drawTypeDISCORD_ID": "When the winners are drawn, you will be provided with the Discord ID and tags of the winners.",
				"drawTypeCARDANO_ADDRESS": "When the winners are drawn, you will be provided with the Cardano wallet address of the winners.",
				"winnerCountDISCORD_ID": "When the giveaway is closed, **{{winnerCount}} winners** will be drawn.",
				"winnerCountCARDANO_ADDRESS": "When the giveaway is closed, **{{winnerCount}} winners** will be drawn.",
				"participationWeighted": "Users: **{{entrants}}**\nTotal giveaway entries: **{{entries}}**",
				"participation": "Total giveaway entries: **{{entries}}**"
			},
			"add": {
				"previewPhase1": "Welcome to the new giveaway wizard 🧙‍♂️! We will walk you through creating a new giveaway for your server.\n⚠ We highly suggest only running this command in a private channel as you will be asked to type messages to populate the description and options later on.\n\nYou've configured the following initial settings for your giveaway:",
				"previewPhase1Details": "**Internal name**: {{name}}\n**Display name**: {{{displayName}}}\n**Number of winners**: {{winnerCount}}",
				"previewPhase1DetailsImage": "\n**Giveaway logo URL**: {{{logoUrl}}}",
				"previewPhase1DetailsOpenTime": "\n**Giveaway start time**: Users will be able to start participating at <t:{{timestamp}}>",
				"previewPhase1DetailsCloseTime": "\n**Giveaway end time**: Users can participate until <t:{{timestamp}}>",
				"previewPhase1DetailsSnapshotTime": "\n**Snapshot time**: The token snapshot for this poll will be done at <t:{{timestamp}}>",
				"previewPhase1NoChannel": "You have not selected a channel for the bot to post a giveaway announcement in at giveaway start time.",
				"previewPhase1Channel": "The bot will post a giveaway announcement in <#{{publishChannel}}> once the giveaway starts.",
				"previewPhase1NoRequiredRole": "No role requirements are in effect - everybody will be able to see the giveaway.",
				"previewPhase1RequiredRole": "To participate in the giveaway, users will need to be assigned the <@&{{requiredRole}}> role. You can additional roles via the */configure-giveaway update* command later.",
				"previewPhase1NextSteps": "❗ Please send a message to this current channel (<#{{currentChannel}}>) in the next 5 minutes, containing the description for your giveaway that you would like to use:",
				"startPhase3": "Use this description",
				"redoPhase2": "Change description",
				"previewPhase2Description": "**Giveaway Details**:\n{{{description}}}",
				"previewPhase3NextSteps": "❗ Please select some final settings for your giveaway. If you choose token ownership to be required, a final step will ask you for information about the giveaway snapshot",
				"isUniqueWinners": "Every drawn winner must be unique?",
				"uniqueWinnersYes": "Can only win once",
				"uniqueWinnersYesDescription": "Every user can win at most once",
				"uniqueWinnersNo": "Can win multiple times",
				"uniqueWinnersNoDescription": "Users can win multiple times if they have more than one entry",
				"selectDrawType": "What info will identify winners?",
				"drawTypeDiscordId": "Discord Info",
				"drawTypeDiscordIdDescription": "The winners Discord ID and tag will be shown",
				"drawTypeWalletAddress": "Wallet address",
				"drawTypeWalletAddressDescription": "The winners wallet address will be shown",
				"isTokenOwnershipRequired": "Can only token holders participate in this giveaway?",
				"tokenTypeNone": "Everyone",
				"tokenTypeHolderOnly": "Holders",
				"tokenTypeHolderWeighted": "Weighted",
				"tokenTypeNoneDescription": "No, anyone can",
				"tokenTypeHolderOnlyDescription": "Yes, each holder gets one entry",
				"tokenTypeHolderWeightedDescription": "Yes, holders get entries based on owned number of tokens",
				"startPhase4": "Provide token details",
				"previewPhase4NextStepsPolicyIdOnly": "Only people that are verified owners of tokens from the policy *{{policyId}}* can participate.",
				"previewPhase4NextStepsPolicyIdAndFingerprint": "Only people that are verified owners of tokens from the policy *{{policyId}}* with the asset fingerprint *{{assetFingerprint}}* can participate.",
				"previewPhase4NextStepsWeighted": "The entry count will be based on the amount of tokens.",
				"previewPhase4NextSteps": "❗ Please enter the policy ID of the token that entrants will be participating with. If using fungible tokens, we also recommend to provide the asset fingerprint, separated with a plus from the policy ID, as follows: *489aa3378d13c87ad4e595ab2a9092e9c92bd645b725b853a3cdebf3+asset1acqu7skxpaj2k5kgnvpk96yclag4nfw48zkpek*",
				"noSnapshotTimeProvided": "⚠ No snapshot time provided. The snapshot will be taken within the next thirty minutes.",
				"redoPhase4": "Change token data",
				"finish": "Create giveaway",
				"success": "✅ New giveaway with the following settings added to this server:",
				"errorTimeout": "The giveaway wizard 🧙‍♂️ timed out waiting for your input, sorry. Please restart the wizard via the */configure-giveaway add* command.",
				"errorPolicyFormat": "The format of either the policy ID, the asset fingerprint, or both are incorrect.\nValid policy IDs have 56 alphanumberic characters.\nAsset fingerprints look as follows: *asset1acqu7skxpaj2k5kgnvpk96yclag4nfw48zkpek*",
				"invalidName": "⚠ Could not add giveaway because the name \"{{giveawayName}}\" was invalid. While the display name can be any text, the internal name needs to be start with a letter and can only contain letters and numbers, no whitespaces or special characters, and 30 characters or less.",
				"noPremium": "🙀 You currently can not add any giveaways as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status."
			},
			"announce": {
				"purpose": "👇 Pick a giveaway from the list of available giveaways to announce. If the giveaway is still open, a vote button will also be added to the widget.\n\n{{{participationPublishingInfo}}}\n\n💡 You can only have one announcement for each giveaway at a time. The announcement will automatically be updated with the current participation counts every 5 minutes.",
				"participationPublishYes": "📢 The (current) entry counts will be published along with the giveaway announcement.",
				"success": "✅ Results successfully published in <#{{channel}}>.",
				"publicSuccess": "🎁 The team shared the following giveaway with you.",
				"chooseGiveaway": "Pick the giveaway you'd like to announce",
				"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages** and **Embed Links** permissions for the bot to allow announcing in it.",
				"errorWrongChannelType": "This channel cannot be used for giveaway announcements."
			},
			"end": {
				"purpose": "👇 Pick a giveaway from the list of available giveaways to end and draw winners for. If the giveaway is already closed, you will be asked if you want to redraw in a separate step.",
				"success": "✅ Successfully picked the winners for **{{{displayName}}}**:",
				"successRedraw": "✅ Successfully reset and picked the winners for **{{{displayName}}}**:",
				"successPublish": "✅ Successfully published giveaway winners for **{{{displayName}}}**.",
				"redrawWarning": "⚠ The winners for the giveaway **{{{displayName}}}** have already been drawn. Would you like to redraw them?",
				"redrawButton": "Redraw winners",
				"winnerList": "{{winnerCount}} winners drawn",
				"winnerListContinued": "Winners (continued)",
				"chooseGiveawayDetails": "Choose the giveaway you want to draw winners for",
				"publishButton": "Publish winners",
				"winnerDrawDiscordId": "{{place}}. <@{{userId}}>",
				"winnerDrawError": "{{place}}. ⚠ UNKNOWN DISCORD USER",
				"winnerDrawCardanoAddress": "{{place}}. **{{winnerAddress}}**",
				"errorDraw": "⚠ Error drawing your winners for giveaway **{{{displayName}}}**. Likely there are not enough entrants to match your winner count and uniqueness conditions for this giveaway."
			},
			"remove": {
				"success": "🗑️ Removed the following giveaway from this server:",
				"purpose": "Select the giveaway to remove from your Discord server.\n\n⚠ **ALL REGISTERED PARTICIPANTS WILL BE REMOVED AND BECOME INACCESSIBLE FOR YOU, IF YOU REMOVE THE GIVEAWAY**.\n\nOnly do this after you have processed this giveaway.",
				"errorNotFound": "⚠ No giveaway with the ID **{{giveawayId}}** was found for this server. Nothing was removed.",
				"chooseGiveawayDetails": "Choose the giveaway you want to irrevocably delete"
			},
			"update": {
				"addrole": {
					"success": "✅ The role <@&{{roleId}}> was successfully added as an eligible role to participate in the giveaway **{{{giveaway.displayName}}}**.",
					"purpose": "Select the giveaway you would like the role <@&{{roleId}}> to be able to participate in.\n\n💡 All other requirements, like giveaway times and holding any tokens from related snapshot, remain in place in addition to the existing role requirements.",
					"chooseGiveaway": "Choose the giveaway you want to allow this role to participate in",
					"tooManyRoles": "⚠ Cannot add more than 20 roles to a giveaway.",
					"roleExists": "⚠ The role <@&{{roleId}}> is already allowed to participate in this giveaway and was not added again."
				},
				"removerole": {
					"success": "🗑️ The role <@&{{roleId}}> was successfully removed from being eligible to participate in the giveaway **{{{giveaway.displayName}}}**.",
					"purpose": "Select the giveaway you would like to remove a role from being allowed to participate in.\n\n💡 All other requirements, like giveaway times and holding any tokens from related snapshot, remain in place in addition to the existing role requirements.",
					"chooseGiveaway": "Choose the giveaway you want to remove this role from",
					"chooseRolePurpose": "Choose which role you would like to remove from the giveaway {{{displayName}}}:",
					"chooseRole": "Choose role to remove",
					"noRoles": "⚠ No roles to remove exist on this giveaway."
				}
			}
		},
		"quiz": {
			"list": {
				"purpose": "This is the list of all existing quizzes for this Discord server.",
				"noQuizzesTitle": "No quizzes",
				"noQuizzes": "Currently, no available quizzes were found for this server.",
				"quizInfo": "Winner count: {{winnerCount}}",
				"quizInfoOpen": "\nOpens on: <t:{{timestamp}}>",
				"quizInfoClose": "\nCloses on: <t:{{timestamp}}>",
				"chooseQuizDetails": "Choose the quiz you want more details on",
				"details": "Quiz Details",
				"detailsName": "Display name (Internal name)",
				"detailsDescription": "Description",
				"detailsDescriptionEmpty": "N/A",
				"detailsCreation": "Created at",
				"creationDate": "<t:{{createTime}}>",
				"detailsDates": "Starts/Ends",
				"detailsConfiguration": "Quiz configuration",
				"detailsRoles": "User has to have one of the following roles",
				"requiredRoleEntry": "• <@&{{role.roleId}}>",
				"detailsChannel": "Announcement info",
				"announcementNone": "No quiz announcement will be made by the bot.",
				"announcementChannel": "A quiz announcement with info on how to participate will be posted in <#{{quiz.channelId}}> when the quiz starts.",
				"adminName": "{{{quiz.displayName}}} ({{quiz.name}})",
				"noPremium": "🙀 Users currently can not participate in or view any quizzes as your server is not running **Black Edition**. Please run **/configure-premium status** to check your Black Edition status.",
				"winnerCountDescription": "Winner count",
				"winnerCount": "When the quiz is closed, **{{winnerCount}} winners** will be drawn."
			},
			"add": {},
			"announce": {
				"purpose": "👇 Pick a quiz from the list of available quizzes to announce. If the quiz is still open, a vote button will also be added to the widget.\n\n{{{participationPublishingInfo}}}\n\n💡 You can only have one announcement for each quiz at a time. The announcement will automatically be updated with the current participation counts every 5 minutes.",
				"participationPublishYes": "📢 The (current) entry counts will be published along with the quiz announcement.",
				"success": "✅ Results successfully published in <#{{channel}}>.",
				"publicSuccess": "❔ The team shared the following quiz with you.",
				"chooseQuiz": "Pick the quiz you'd like to announce",
				"errorNoSendPermissions": "The bot has no permissions to send messages to or view the channel <#{{channel}}>. Please allow the **View Channel**, **Send Messages** and **Embed Links** permissions for the bot to allow announcing in it.",
				"errorWrongChannelType": "This channel cannot be used for quiz announcements."
			},
			"end": {
				"purpose": "👇 Pick a quiz from the list of available quizzes to end and draw winners for. If the quiz is already closed, you will be asked if you want to redraw in a separate step.",
				"success": "✅ Successfully picked the winners for **{{{displayName}}}**:",
				"successRedraw": "✅ Successfully reset and picked the winners for **{{{displayName}}}**:",
				"successPublish": "✅ Successfully published quiz winners for **{{{displayName}}}**.",
				"redrawWarning": "⚠ The winners for the quiz **{{{displayName}}}** have already been drawn. Would you like to redraw them?",
				"redrawButton": "Redraw winners",
				"winnerList": "{{winnerCount}} winners drawn",
				"chooseQuizDetails": "Choose the quiz you want to draw winners for",
				"publishButton": "Publish winners",
				"winnerDrawDiscordId": "{{place}}. <@{{userId}}>",
				"winnerDrawError": "{{place}}. ⚠ UNKNOWN DISCORD USER",
				"winnerDrawCardanoAddress": "{{place}}. **{{winnerAddress}}**",
				"errorDraw": "⚠ Error drawing your winners for quiz **{{{displayName}}}**. Likely there are not enough entrants to match your winner count and uniqueness conditions for this quiz."
			},
			"remove": {
				"success": "🗑️ Removed the following quiz from this server:",
				"purpose": "Select the quiz to remove from your Discord server.\n\n⚠ **ALL REGISTERED PARTICIPANTS AND QUESTIONS WILL BE REMOVED AND BECOME INACCESSIBLE FOR YOU, IF YOU REMOVE THE QUIZ**.\n\nOnly do this after you have processed this quiz.",
				"errorNotFound": "⚠ No quiz with the ID **{{quizId}}** was found for this server. Nothing was removed.",
				"chooseQuizDetails": "Choose the quiz you want to irrevocably delete"
			},
			"update": {
				"addrole": {
					"success": "✅ The role <@&{{roleId}}> was successfully added as an eligible role to participate in the quiz **{{{quiz.displayName}}}**.",
					"purpose": "Select the quiz you would like the role <@&{{roleId}}> to be able to participate in.\n\n💡 All other requirements, like quiz times, remain in place in addition to the existing role requirements.",
					"chooseQuiz": "Choose the quiz you want to allow this role to participate in",
					"tooManyRoles": "⚠ Cannot add more than 20 roles to a quiz.",
					"roleExists": "⚠ The role <@&{{roleId}}> is already allowed to participate in this quiz and was not added again."
				},
				"removerole": {
					"success": "🗑️ The role <@&{{roleId}}> was successfully removed from being eligible to participate in the quiz **{{{quiz.displayName}}}**.",
					"purpose": "Select the quiz you would like to remove a role from being allowed to participate in.\n\n💡 All other requirements, like quiz times, remain in place in addition to the existing role requirements.",
					"chooseQuiz": "Choose the quiz you want to remove this role from",
					"chooseRolePurpose": "Choose which role you would like to remove from the quiz {{{displayName}}}:",
					"chooseRole": "Choose role to remove",
					"noRoles": "⚠ No roles to remove exist on this quiz."
				}
			}
		}
	},
	"start": {
		"welcomeTitle": "Welcome to HAZELnet!",
		"completeTitle": "Great work! 😻",
		"configureMessage": "The /start command will help you set up your HAZELnet bot. Select your options below:",
		"configureLanguageTitle": "Language",
		"configureAdminRoleTitle": "Admin Role",
		"configureUserRoleTitle": "User Role",
		"configureFeaturesTitle": "Features",
		"configureLanguageText": "This setting determines the language of all bot commands and interactions. Currently it is not possible to have commands translate on a per-user basis - bot replies will in the future be able to be based on a user-selected language.",
		"configureAdminRoleText": "All users with the admin role will be able to configure the bot. Admins can set official stakepools, policies and automatic role-assignments. Expose these abilities to as few people as possible. The guild owner will always have access to all commands, regardless of this setting. If you have more than 25 roles, only your first 25 will be shown here. Use the */configure-adminaccess* command to adjust this later.",
		"configureFeaturesText": "The features that you enable will determine which commands are available to users and administrators. Depending on which features you turn on, you will have different capabilities available. Certain features require a premium subscription called **Black Edition**. See our website for more information.",
		"chooseLanguage": "Choose your bot language",
		"chooseAdminRole": "Choose your admin role",
		"chooseUserRole": "Choose your user role",
		"chooseFeatures": "Choose all of the features you want to use",
		"selectedLanguage": "Your selected language is **{{language}}**.",
		"selectedAdminRoles": "The users with the following roles will be able to configure the bot:",
		"selectedUserRoles": "The users with the following roles will be able to verify their wallets and interact with the bot:",
		"selectedFeatures": "You have selected the following features:\n\n{{{selectedFeatureList}}}",
		"selectedFeatureItem": "• **{{{feature}}}**",
		"finishSetupButton": "Finish setup",
		"resetSetupButton": "Reset settings",
		"setupRoleWarningMessage": "**Your setup is complete with warnings**:\n\n❗ Please be aware the bot did not find all the necessary permissions through roles assigned to it. Make sure the bot has one or multiple roles that grant at least the following permissions: Send Messages, Read Messages, Manage Messages, Manage Roles\n\n💡 Make sure the bot role is high enough in the Discord role list, so it can assign any auto-assign roles it is configured to manage.",
		"setupCompleteMessage": "**Your setup is complete!**\n\n👉 Make sure the bot role is high enough so it can assign any auto-assign roles it is configured to manage.\n\nℹ Make sure you also disable/enable the correct commands by going to \"Server Settings\" - \"Integrations\", selecting HAZELnet and setting the permissions for **/configure-** commands for your selected admin role, and enable the user-facing commands for your normal users.",
		"nextStepsTitle": "💡 Next steps",
		"nextStepsDetails": "You are now ready to start adding token roles, verification widgets, and more…\n\nIf you are not sure where to start, some common first steps are adding a verification widget **/configure-verify announce** and adding your first token role via **/configure-tokenroles add**. You can click *Click for help* at the top of each command to get detailed info, run **/help** to see what is available, or just browse our documentation to learn more at https://www.hazelnet.io/documentation"
	},
	"features": {
		"stakepoolTitle": "Stakepools",
		"stakepool": "Stakepool features (official pools, delegator roles)",
		"tokenTitle": "Tokens",
		"token": "Fungible tokens and NFTs (official policies, token roles)",
		"whitelistTitle": "Whitelists (Black Edition only)",
		"whitelist": "Self-service address whitelists with requirements",
		"pollTitle": "Polls (Black Edition only)",
		"poll": "Polls and voting system for open and holder-limited polls",
		"pollVoteaireTitle": "Voteaire Polls",
		"pollvoteaire": "Integration with the on-chain voting tool Voteaire",
		"giveawayTitle": "Giveaways (Black Edition only)",
		"giveaway": "Custom and weighted giveaways for your community",
		"quizzesTitle": "Quizzes (Black Edition only)",
		"quiz": "Build custom quizzes for your community",
		"claimphysicalTitle": "Physical Item Claiming (Black Edition only)",
		"claimphysical": "Claiming physical items via verified lists",
		"marketplaceTitle": "Marketplaces and Mints (Black Edition only)",
		"marketplace": "Marketplace integrations, listings, minting, and sales trackers",
		"engagementTitle": "Engagement Tools (Black Edition only)",
		"engagement": "Various tools to track and improve community engagement",
		"cardolphins": "Cardolphins Special",
		"handle": "ADA Handle Integration"
	},
	"marketplaces": {
		"JPGSTORE": "JPG.store",
		"MINT_ONCHAIN": "Minting",
		"PLUTUSART": "plutus.art",
		"ALL_MARKETPLACES": "All marketplaces"
	},
	"stakingProviders": {
		"MUTANT_STAKING": "Mutant Staking"
	},
	"generic": {
		"cancel": "Cancel",
		"yes": "Yes",
		"no": "No",
		"clickhelp": "Click for help",
		"advertisement": "Advertisement",
		"blackEditionWarning": "🐱‍👤 Black Edition missing"
	},
	"languages": {
		"en": "English",
		"de": "German"
	},
	"errors": {
		"notYetImplemented": "Not yet implemented. Please be patient with us.",
		"permissionDeniedTitle": "Permission Denied",
		"permissionDeniedInformation": "⛔ You do not have permission to access this information.",
		"permissionDeniedChanges": "⛔ You do not have permission to make these changes.",
		"notWhitelisted": "Thank you for your interest in HAZELnet. Unfortunately, your server is not on the early access list. Contact @NilsCodes on Twitter to see if you can participate in the beta program.",
		"invalidIsoDateFormat": "Invalid date format value \"{{value}}\" for parameter \"{{parameter}}\" - the format needs to be yyyy-MM-ddTHH:mm:ssZ (for example 2022-01-31T15:00:00Z)",
		"invalidHttpsUrl": "Invalid URL provided with value \"{{value}}\" for parameter \"{{parameter}}\". Please provide a valid *https://* URL."
	},
	"about": {
		"title": "About HAZELnet",
		"info": "The HAZELnet Discord Community System was proudly built by the operators of HAZEL stakepool. We appreciate all our delegators and would love your support on our mission to improve feline lives.\n\nIf you would like this Discord bot in your server for free, visit https://www.hazelnet.io or https://twitter.com/HAZELnet_io",
		"twitter": {
			"author": "@NilsCodes on Twitter",
			"bot": "@HAZELnet_io on Twitter"
		}
	},
	"": "",
	"banEntry_ASSET_FINGERPRINT_BAN_PREVENT_ROLES": "banEntry_ASSET_FINGERPRINT_BAN_PREVENT_ROLES",
	"banEntry_STAKE_ADDRESS_BAN_PREVENT_ROLES": "banEntry_STAKE_ADDRESS_BAN_PREVENT_ROLES"
}