{
	"commands": {
		"descriptions": {
			"policyid": "Lists all policy IDs and projects associated with this server.",
			"info": "Shows info and stakepools for this server.",
			"whitelist": "View and register for whitelist events in this Discord.",
			"whitelist-register": "Register for a whitelist",
			"whitelist-list": "Show all whitelists and requirements for each whitelist.",
			"whitelist-unregister": "Remove yourself from a whitelist",
			"help": "Show general help on how to use this bot.",
			"vote": "View the list of open polls and vote, if you are eligible.",
			"claim": "Claim virtual or physical goods you are eligible for.",
			"premium": "Manage your premium account and check your claimable $HAZEL balance and other perks.",
			"configure-settings": "General configuration options for the bot",
			"configure-settings-features": "Turn features of the bot on and off for the whole server.",
			"configure-poll": "Manage polls for people to vote on (off-chain)",
			"configure-poll-list": "List all polls that are set up on this Discord server.",
			"configure-poll-add": "Adds a new poll to the server. You will be able to determine voting conditions and visibility.",
			"configure-poll-remove": "Select and remove an existing poll. ⚠ This will also remove all votes and previous results.",
			"configure-whitelist": "Manage whitelists for people to submit addresses for",
			"configure-whitelist-add": "Adds a new whitelist that people on this Discord can sign up for, depending on if they meet the required criteria.",
			"configure-whitelist-list": "List all whitelists that are defined on this Discord server.",
			"configure-whitelist-close": "Temporarily or permanently close a whitelist for registrations.",
			"configure-whitelist-open": "Reopen a closed whitelist for registrations.",
			"configure-whitelist-remove": "Select and remove an existing whitelist. ⚠ This will also remove all registrations.",
			"configure-premium": "Set up and get info about your Black Edition Premium status.",
			"configure-premium-stake": "Configure which wallet should be used as your delegation wallet for Black Edition usage."
		},
		"options": {
			"whitelist": {
				"name": "Name of the whitelist",
				"address-or-handle": "The Cardano wallet address or $handle to add register for the whitelist.",
				"includeaddress": "Use this parameter and pass True if you want your registered address displayed on screen."
			},
			"configure-poll": {
				"poll-name": "The internal name for this poll (can only be up to 30 alphanumeric characters)",
				"poll-displayname": "The display name for this poll that your users will see",
				"required-role": "Role that is required for a user to have, to be able to vote in this poll",
				"publish-channel": "An optional channel where the announcement and results are published",
				"poll-opentime": "The UTC time after which voting is possible (Format: 2022-01-01T15:00:00Z)",
				"poll-closetime": "The UTC time until which voting is possible (Format: 2022-01-31T15:00:00Z)"
			},
			"configure-whitelist": {
				"whitelist-name": "The internal name for this whitelist (can only be up to 30 alphanumeric characters)",
				"whitelist-displayname": "The display name for this whitelist (for your users)",
				"required-role": "Role that is required for a user to have, to be able to register for this whitelist.",
				"max-users": "The maximum number of users that can sign up for this whitelist.",
				"signup-start": "An optional UTC time after which registration is possible (Format: 2022-01-01T15:00:00Z)",
				"signup-end": "An optional UTC time until which registration is possible (Format: 2022-01-31T15:00:00Z)"
			}
		}
	},
	"info": {
		"welcomeTitle": "Welcome to {{{guildName}}}!",
		"infoBaseText": "The team is happy to have you here!",
		"stakepoolsBaseText": {
			"one": "This server officially supports this Cardano stakepool:",
			"other": "This server officially supports the following Cardano stakepools:"
		},
		"stakepoolDetails": "#️⃣ *Pool hash:*\n{{hash}}\n\nℹ *Description:*\n{{{description}}}\n\n🌍 *Website:*\n{{{website}}}\n\n👁 *Pool.pm:*\nhttps://pool.pm/{{hash}}",
		"stakepoolDetailsShort": "https://pool.pm/{{hash}}"
	},
	"help": {
		"messageTitle": "Get help for {{{botName}}}",
		"generalCommands": {
			"verify": "The */verify* command and its subcommands let you verify your own Cardano address and will enable features like automatic role-assignments based on delegation and token roles.\n**Important:** 💡 The admins of this Discord will *not* be able to see any of your verified addresses. They can only see addresses that you register for a whitelist! Your security always comes first.",
			"verify-add": "With */verify add* you can add a new address to your list of verified wallets. Issuing the command will ask you to send a specific amount of ADA to yourself within a specific amount of time. If the transaction is confirmed this verifies your wallet and allows the system to also verify token and NFT ownership. A wallet can only be registered with one Discord user at one time.\n❕ You can also provide a handle for verification - it will automatically be resolved into an address.\n💡 Verifying a wallet will link the Discord server on which you are performing the verification as part of the process, so no explicit */verify link* is needed.",
			"verify-help": "This command, which will print out information on how to use the */verify* feature.",
			"verify-link": "When you first join a server, all your verified addresses will not be linked by default. This means your privacy comes first and you will not be assigned any roles without authorizing it via */verify link*. This command will enable this bot to assign automatic roles and use other features on this specific Discord server for your account.",
			"verify-list": "When using */verify list*, all your open and confirmed verifications will be listed. If you ever get disconnected during a verification process, you can retrieve the info needed to verify here. This command also lets you cancel your open verification, if needed.",
			"verify-remove": "If you want to remove a verified address from your account, simply use */verify remove* and the wallet will not be used for any token roles or other features on any of your link Discord servers any more.",
			"verify-unlink": "If you would like to unlink a wallet from a specific Discord server, because you wish to not receive automatic role-assignments or other treatment that might reveal anything about you, use the */verify unlink* command.",
			"help": "Shows this help text."
		},
		"stakepoolCommands": {
			"info": "The */info* command gives you some basic information about the server and lists any official stakepools of the server, if it has any set up."
		},
		"nftCommands": {
			"policyid": "If this server has any official Cardano policy IDs and corresponding projects, they will be displayed when you use the */policyid* command. These policies can be for both fungible tokens and NFTs."
		},
		"whitelistCommands": {
			"whitelist": "You can use the */whitelist* command to see which whitelists are available on this server (via the *list* subcommand), or register and unregister from whitelists you qualified for via the respective *register* and *unregister* subcommands."
		},
		"adminCommands": {
			"title": "The following are commands for administrators only (normal users do not get this text when using */help*)",
			"configure-protection": "With */configure-protection* you can view and set up the scam and fake protection of the bot. It will let you set up automatic removal of messages with **addr1** as content, as well as an optional auditing of such messages to a dedicated channel for moderators.",
			"configure-stakepool": "*/configure-stakepool* provides commands to add, list and remove stakepools for this Discord server. These are needed if you intend to set up delegator roles or if you want your pool information to be listed via the */info* command.",
			"configure-delegatorroles": "Once you have set up your official stakepool information via */configure-stakepool* you can assign roles based on delegation to specific pools. You will need the pool hash or you can reference \"all official pools of this Discord\" by leaving the pool hash parameter empty.",
			"configure-policy": "With */configure-policy* you can set up official policy IDs that users can inspect and easily find via the public */policyids* command.",
			"configure-tokenroles": "The */configure-tokenroles* command will allow you to set up automatic role assignments for users that have tokens of specific policies in their verified staking addresses. Users can verify via the public */verify* command.",
			"configure-whitelist": "With this command you can manage whitelists on this server that people can register for via the public */whitelist* command.",
			"configure-adminaccess": "The */configure-adminaccess* command allows you to manage which users can access administrative functions of the bot, like all the */configure* commands.",
			"configure-useraccess": "The */configure-useraccess* command allows you to manage which users on your server are allowed to access this Discord bots basic features.",
			"configure-poll": "The */configure-poll* command enables the creation and management of polls and helps admins set up votings on their server, open or restricted to token-holders.",
			"start": "The */start* command is what you use to set the bot up initially, but also what you can use to reset your bot features and what you might be asked to run if new capabilities get added to the bot."
		}
	},
	"policyid": {
		"messageTitle": "Official policy IDs associated with this Discord",
		"purpose": "This is the official list of projects that are related to this server. This does not mean that this is the official Discord for the respective projects, but that the administrators of this server added them as policies here.\n💡 Please verify on the respective project website, if you are on their official Discord server before following any buy links etc.",
		"noProjectName": "No official policies",
		"noPolicies": "*Currently, this server has no token policies listed.*",
		"projectPolicyId": "The policy ID for this project is **{{policyId}}**"
	},
	"vote": {
		"messageTitle": "Current polls and decisions on this Discord",
		"purpose": "Find ongoing and completed polls on this server and view the results or vote, if you fulfill the required voting conditions.",
		"pollInfo": "{{{poll.description}}}",
		"yourVote": "Your current vote",
		"pollInfoTitle": "Information about this poll",
		"optionList": "Multiple options allowed: {{multipleVotes}}\nToken-based vote: {{tokenBased}}\nWeighted vote: {{weighted}}",
		"currentResults": "Current results",
		"resultsNotVisible": "The results of this poll are hidden until the team publishes them.",
		"yourVotingPower": "Your voting power",
		"votingPowerMultiple": "Based on token ownership for this poll you have a total voting power of {{totalVotingPower}} in your verified wallets.",
		"votingPowerSingleNoToken": "This poll is not token-based and as such you have a voting power of one.",
		"votingPowerSingleToken": "Based on the token ownership snapshot you have one vote in this poll.",
		"votingPowerTokenInfo": "💡 If you feel your voting power is not accurate, ensure all your wallets are linked. The snapshot for this poll may also be different from the current token count in your wallet.",
		"chooseVoteOption": "Choose what to vote for",
		"voteSuccess": "✅ You have successfully cast your vote. You can revote at any time using the */vote* command.",
		"changeVoteOption": "Change your vote",
		"choosePoll": "Pick the poll you'd like to know more about",
		"abstainVote": "Abstain/remove your vote",
		"abstainVoteSuccess": "✅ Your vote was successfully removed from the poll! You can revote at any time using the */vote* command.",
		"noPollsTitle": "No polls",
		"noPolls": "Currently, no available polls were found for this server."
	},
	"claim": {
		"messageTitle": "Claim your physical items",
		"purpose": "If you've minted a specific NFT or participated in an event or whitelist, you may be eligible to claim physical items. This command will let you pick your items and will then ask you for your shipping address via DM.\n💡 The system is opaque for the Discord operators and while they will receive your shipping address, they will not be provided with the associated stake address, keeping your personal data private.",
		"availableClaimListsTitle": "Claim lists available!",
		"availableClaimLists": "The following claim lists are available. Select your list and make sure you can receive direct messages from the bot, so it can ask you for your physical address.",
		"chooseClaimList": "Choose what you want to claim",
		"claimProductDetails": "You can claim this item {{available}} times.",
		"orderStartedTitle": "Order checkout started",
		"orderStarted": "⏳ Please check your direct messages from <@{{botUser}}> to finalize your order process.",
		"checkoutTitle": "Choose your items",
		"checkout": "ℹ Please choose the items you would like to claim. Below is a list of total claimable items - the bot will guide you through selecting the available choices for each of your items.",
		"existingOrderTitle": "Existing order found",
		"existingOrder": "💡 We have found an existing order for this claim list and <@{{botUser}}> has sent you the details. You can verify your order in your direct messages. Contact the project team, should you need to change your order.",
		"noDirectMessageTitle": "No Direct Messaging possible",
		"shoppingCart": "🛒 Your current cart",
		"shoppingCartEmpty": "No items in your cart.",
		"chooseShippingType": "Choose shipping type",
		"shippingTypeUSA": "Domestic (United States)",
		"shippingTypeInternational": "International",
		"enterShippingData": "Enter shipping address",
		"clearShoppingCart": "Empty shopping cart",
		"enterShipTo": "✍ Please enter your full name for your ship to address:",
		"enterCountry": "🏳 Please enter your country:",
		"enterPhone": "📞 For international orders, we need your phone number, including country code:",
		"enterCity": "🏙 Please enter your city name (and state, if applicable):",
		"enterStreet": "🛣 Please enter your full street address, including house number, apartment etc.:",
		"enterZipCode": "🔢 Please enter your zip code:",
		"addressEntryComplete": "☑ Address entry complete. Please verify your shopping cart contents and address information.\n💡 Once submitted, your order can only be changed by contacting the project team.",
		"checkoutComplete": "☑ You have successfully submitted your order. You can see your order details by running the */claim* command again in your respective Discord server. The project team will be in touch with updates on the delivery.",
		"checkoutError": "⚠ There was an error submitting your order. We apologize for the inconvenience. We suggest to start the process via */claim* once more, as there can be problems if the order entry takes longer than 15 minutes overall from the initial claim to completion. If the error persists on the second attempt we ecommend getting in touch with the project team. Make sure to write down the current time and time zone, so we can find the problem easier.",
		"currentAddress": "📦 Shipping To",
		"currentAddressData": "{{shipTo}}\n{{street}}\n{{zipCode}} {{city}}\n{{country}}\n{{phone}}",
		"noCurrentOrderProcessTitle": "No order in process",
		"noCurrentOrderProcess": "⚠ Sorry, there is no current order active, so I cannot respond properly. If you are reacting to an older message please start the order process again in the respective Discord by running */claim*.",
		"noDirectMessage": "⚠ The bot is not able to send you a direct message, which means it will not be able to collect your shipping address. Please click on the server name, select **Privacy Settings** and enable **Allow direct messages from server members**. You can disable it again after the claim process is complete.",
		"noClaimListsTitle": "No claim lists available",
		"noClaimLists": "*Currently, you do not qualify for any claim lists.*\n\nℹ If you think you qualify, make sure your respective staking address is verified and linked via the */verify list*, */verify add* and */verify link* commands.",
		"submitOrder": "Submit order",
		"helpChannelTitle": "Help with your order",
		"helpChannel": "If you need assistance with your order, please get in touch with our team in the channel <#{{helpChannel}}>. We are happy to help you out.",
		"noDescription": "No Description provided"
	},
	"premium": {
		"messageTitle": "View your premium status",
		"purpose": "Here you can see your claimable $HAZEL balance and see if you have pledged your support to this project. You can also check if you're the winner of a recent premium giveaway.",
		"premiumStatus": "Premium Status",
		"premiumStatusNo": "You are currently not a premium user. Simply visit https://www.hazelnet.io/stakepool and use the **Stake for Premium** button. Any staking amount on any of your verified wallets will get you premium status.",
		"premiumStatusYes": "Thanks for supporting HAZELnet with your stake!\n\nClaimable $HAZEL balance: {{balance}}",
		"serverSupport": "Server Support",
		"serverSupportYes": "You have pledged your staked ADA to the following Discord servers:",
		"serverSupportEntry": "• {{serverName}}",
		"serverSupportNo": "You have not pledged your staked ADA to a Discord server. You can choose to support one or more Discord servers with your stake, without any downsides. Pledging your HAZEL premium account to a server means directly supporting your project.\n\nYou can change this at any time.",
		"pledgeButtonYes": "Pledge your support to {{{guildName}}}",
		"pledgeButtonNo": "Revoke your pledge to {{{guildName}}}"
	},
	"verify": {
		"list": {
			"messageTitle": "Your verified addresses",
			"noVerifications": "You have no outstanding or confirmed verifications. If you would like to verify a Cardano address, please use the '/verify add' command.",
			"listVerificationsInfo": "View your link status with this specific server and see which addresses are verified or waiting for verification with your account across all your Discord servers:",
			"confirmedVerificationFor": "✅ Confirmed verification for {{stakeShort}}…",
			"confirmedData": "Address *{{verification.address}}* for stake address https://pool.pm/{{verification.cardanoStakeAddress}} via transaction https://cardanoscan.io/transaction/{{verification.transactionHash}}, confirmed at *{{verification.confirmedAt}}*.",
			"outstandingVerifications": "⏳ Outstanding verifications",
			"outstandingData": "Waiting for **₳{{amount}}** to be sent to *{{verification.address}}* for a successful verification.",
			"accountIsLinked": "⚡ Linked",
			"accountIsLinkedInfo": "Your verified wallets are linked with this Discord server and you will be automatically assigned roles and access other features, if configured by the server admin.\nℹ To unlink, use */verify unlink*",
			"accountIsNotLinked": "🔌 Not Linked",
			"accountIsNotLinkedInfo": "Your verified wallets are not linked with this Discord server and your privacy is ensured. No automatic role assignments will be done and you cannot use any other features that require a validated wallet.\nℹ To link your already verified wallets to this server, use */verify link*",
			"cancelOutstanding": "Cancel open verification",
			"cancelSuccess": "❌ Outstanding verification for address {{address}} was successfully cancelled. You can now start a new verification process."
		},
		"help": {
			"messageTitle": "Help about the /verify command"
		},
		"add": {
			"messageTitle": "Verify a new address",
			"alreadyVerified": "✅ Found an existing verification for your user and the address *{{address}}*. Your stake address **{{verification.cardanoStakeAddress}}** is successfully registered on this server.",
			"outstandingVerification": "⏳ Found an outstanding verification on this or another server. Please complete your other verification first. You can find your outstanding verification details with the */verify list* command.",
			"verificationRequest": "⌛ Please send **₳{{amount}}** to your own address at *{{verification.address}}* within the next {{maxTime}} minutes.\n\n⚠ Do not include any other tokens and make sure to send from (and to) the wallet that owns this address. Transactions that include outputs to any other addresses will not be considered and your fees will not be reimbursed by HAZELnet.io or the operator of this Discord server.\n\n💡 If you close Discord, you can use */verify list* to get your verification data later.",
			"verificationSuccess": "✅ You are now verified with stake address **{{verification.cardanoStakeAddress}}** through transaction *{{verification.transactionHash}}*. Thank you!",
			"verificationWaiting": "⏳ Still awaiting verification...\n\n💡 If you close Discord, you can use */verify list* to get your verification data later.",
			"verificationFailure": "⚠ Verification failed as no transaction with the required data was found on the blockchain. Please try again using the '/verify add' command.",
			"verificationMessageChainEnd": "⏳ We are still waiting for your transaction. However, the bot will now stop messaging you. You can check your verification request status any time by using the */verify list* command.",
			"verificationWalletInUse": "⚠ Verification failed. The stake address that belongs to the address *{{address}}* is already verified with your or another account.",
			"verificationInvalidAddress": "⚠ The submitted address *{{address}}* is not associated with a stake address OR the verification process was cancelled. Please supply a valid wallet address (starts with addr1 and has 103 characters total) or $handle.",
			"verificationInvalidHandle": "⚠ The submitted handle *{{handle}}* is not associated with a stake address. {{{resolveText}}}. Please supply a valid wallet address (starts with addr1 and has 103 characters total) or $handle.",
			"resolveFailure": "The handle did not resolve to any address",
			"resolveSuccess": "The handle resolved to {{resolvedAddress}}"
		},
		"remove": {
			"messageTitle": "Remove a verified address",
			"success": "❗ All verifications with address *{{address}}* for this Discord account have been removed. This affects all Discord servers for which this verification was used!"
		},
		"link": {
			"messageTitle": "Link your wallets to this Discord server",
			"success": "⚡ Your verified wallets and addresses have been successfully linked to this server. You are now eligible for any automatic role assignments and other features that require verified wallets. Role updates will happen during the next update.",
			"notLinked": "⚠ Your user is already linked with this Discord server."
		},
		"unlink": {
			"messageTitle": "Unlink your wallets from this specific Discord server",
			"success": "🔌 Your verified wallets and addresses have been successfully unlinked from this server. You will not receive any further role assignments on this server and all existing automatic role assignments will be removed during the next scheduled update.",
			"notLinked": "⚠ Your user is currently not linked with this Discord server."
		}
	},
	"whitelist": {
		"list": {
			"messageTitle": "Whitelists for this server",
			"purpose": "These are all currently active or recently closed whitelists for this Discord server:",
			"noWhitelistsTitle": "No whitelists",
			"noWhitelistsDetail": "*Currently, this server has no open or recently closed whitelists.*",
			"whitelistRoleRequirement": "Requirement for this whitelist is to have the role <@&{{whitelist.requiredRoleId}}>.{{{datePart}}}",
			"whitelistWithEndDateOpen": "Signup is open until {{signupUntilFormatted}} UTC.",
			"whitelistWithEndDateClosed": "Signup closed at {{signupUntilFormatted}} UTC.",
			"whitelistWithStartDateOpen": "Signup opened at {{signupAfterFormatted}} UTC.",
			"whitelistWithStartDateClosed": "Signup will open at {{signupAfterFormatted}} UTC.",
			"whitelistWithStartDateClosedAndOpenEndDate": "Signup will open at {{signupAfterFormatted}} UTC and will be available until {{signupUntilFormatted}}.",
			"whitelistWithStartDateOpenAndOpenEndDate": "Signup opened at {{signupAfterFormatted}} UTC and will be available until {{signupUntilFormatted}}.",
			"whitelistWithStartDateOpenAndClosedEndDate": "Signup opened at {{signupAfterFormatted}} UTC and closed at {{signupUntilFormatted}}.",
			"whitelistManuallyClosed": "\n⏸ The signup for this whitelist is currently paused by an administrator.",
			"openWhitelist": "There are no start or end dates for this registration.",
			"whitelistMembersNoLimit": "Any number of users can sign up.",
			"whitelistMembersLimit": "{{whitelist.currentUsers}} out of {{whitelist.maxUsers}} have already registered.",
			"whitelistMembersLimitReached": "All {{whitelist.maxUsers}} users have already registered.",
			"youQualify": "✅ You qualify for this whitelist. Add your address via '/whitelist register', if you would like to sign up.",
			"youDontQualify": "⛔ You currently do not qualify for this whitelist.",
			"youAreRegistered": "♥ You successfully registered for this whitelist at {{signupTime}} UTC.",
			"youAreRegisteredWithAddress": "♥ You successfully registered for this whitelist at {{signupTime}} UTC. Your registered address is:\n\n*{{address}}*"
		},
		"register": {
			"messageTitle": "Register for a whitelist",
			"purpose": "Choose the whitelist you would like to register for:",
			"signedupFor": "You are currently registered for the following whitelists:",
			"signedupForEntry": "• **{{{whitelist.displayName}}}**",
			"chooseWhitelist": "Select your whitelist",
			"noOpenWhitelists": "There are currently no further whitelists that you qualify for.\n\n💡 If you verified your wallet within the last few minutes, please wait at least 15 minutes for the automatic role-assignments to take effect. Then try again.",
			"success": "✅ Congratulations, you have successfully registered for the whitelist \"**{{{whitelist.displayName}}}**\"!\n\nUsed address (if you entered a $handle, it was resolved to an address immediately): *{{address}}*",
			"invalidAddress": "This does not look like a valid address: *\"{{address}}\"*. If you used a $handle, please ensure it is correct.\n\nPlease verify you are using a valid {{blockchain}} address to register. Example addresses look as follows *{{example}}*.",
			"errorNotFound": "⚠ Your registration was not successful. No whitelist with the name **{{whitelistName}}** was found for this server.",
			"otherError": "⚠ Error while registering for this whitelist."
		},
		"unregister": {
			"messageTitle": "Unregister from a whitelist",
			"purpose": "Choose the whitelist you would like to remove yourself from:",
			"chooseWhitelist": "Select your whitelist",
			"success": "✅ You have successfully removed yourself from the whitelist \"**{{{whitelist.displayName}}}**\". We're sorry to see you go and hope you'll be back soon.",
			"errorNotFound": "⚠ Your unregistration was not successful. No whitelist with the name **{{whitelistName}}** was found for this server.",
			"noRegisteredWhitelists": "⚠ You are currently not registered for any whitelists.",
			"otherError": "⚠ Error while deleting your whitelist registration info."
		}
	},
	"configure": {
		"policy": {
			"list": {
				"purpose": "This is the list of official policies that this server will present when end users use the /policyid command.\n\n⚠ Do not add policy IDs for projects that are not your own or that you are not officially supporting. Reports of misused policy IDs will be taken seriously by the team and may result in your server being blacklisted for HAZELnet usage."
			},
			"add": {
				"success": "✅ New official token policy added for this Discord server!",
				"errorAlreadyUsed": "⚠ Error while adding your token policy. This policy ID is already added under the name **{{projectName}}**. Each policy ID can only be added once."
			},
			"remove": {
				"success": "🗑️ Removed the following token policy from the official token policy list of this server:",
				"errorNotFound": "⚠ No policy with the ID **{{policyId}}** was found for this server. Nothing was removed."
			}
		},
		"stakepool": {
			"list": {
				"purpose": "This is the list of official stakepools that this server will present when end users use the /info command.\n\n⚠ Do not add stakepools that are not your own or that you are not officially supporting. Reports of misused stakepools will be taken seriously by the team and may result in your server being blacklisted for HAZELnet usage.",
				"noPoolName": "No official stakepools",
				"noPools": "*Currently, this server has no stakepools listed.*"
			},
			"add": {
				"success": "✅ New official stakepool added for this Discord server!"
			},
			"remove": {
				"success": "🗑️ Removed the following stakepool from the official stakepool list of this server:",
				"errorNotFound": "⚠ No stakepool with the hash **{{stakepoolHash}}** was found for this server. Nothing was removed."
			}
		},
		"protection": {
			"status": {
				"purpose": "The following protection mechanisms are active on this server:",
				"protectionTitle": "Protection from addr1-scams",
				"auditChannelTitle": "Auditing of potential scam messages and events"
			},
			"addressremove": {
				"protectionOn": "✅ Your server is protected from scams based on users sending messages containing *addr1*. These messages will be automatically removed in all channels where this bot has permissions to view and manage messages.",
				"protectionOff": "⚠ You have turned off the autoremoval of text messags that contain *addr1* for protection of your users from address-based scams."
			},
			"auditchannel": {
				"auditChannelOn": "✅ Suspicious messages and events in your server will be sent to the channel <#{{auditChannel}}>, if the bot has permissions to send messages to this channel.",
				"auditChannelOff": "⚠ No audit channel has been configured. No potential scam-messages or events will be logged.",
				"auditEventTitle": "⚠ Potential Scam Attempt",
				"auditEventDetail": "User <@{{author}}> sent a suspicious message to channel <#{{{channel}}}> with content \"{{message}}\""
			}
		},
		"tokenroles": {
			"list": {
				"purpose": "This is the list of Discord roles that will be automatically assigned, based on token (NFT and FT) ownership by verified users.",
				"noTokenRolesTitle": "No token roles",
				"noTokenRolesDetail": "*Currently, this server has no token-based roles configured.*",
				"tokenRoleNameOfficial": "Project \"{{{officialProject.projectName}}}\" (Role-ID: {{tokenRole.id}})",
				"tokenRoleNameInofficial": "{{tokenRole.policyId}} (Role-ID: {{tokenRole.id}})",
				"tokenRoleDetails": "All verified users that own a total of at least {{tokenRole.minimumTokenQuantity}} tokens of the policy {{tokenRole.policyId}} {{{fingerprintInfo}}}will be assigned the role <@&{{tokenRole.roleId}}>.",
				"fingerprintInfo": "with the asset fingerprint {{tokenRole.assetFingerprint}} "
			},
			"add": {
				"success": "✅ New automatic role-assignment for the following token owners added to this server:",
				"errorMinimumTokens": "⚠ Automatic token role-assignment could not be added, as minimum token count needs to be at least 1.",
				"errorAssetFingerprint": "⚠ Automatic token role-assignment could not be added, since the provided asset fingerprint did not match the required format. Asset fingerprints look as follows: *asset1acqu7skxpaj2k5kgnvpk96yclag4nfw48zkpek*.",
				"errorPolicyId": "⚠ Automatic token role-assignment could not be added, since the provided policy ID did not match the required format. Policy IDs look as follows: *8f63e08467bfbbc260a382a80f3297f9a569fca0293f296620d72d17*.",
				"roleInUseWarning": "⚠ WARNING - ROLE IN USE",
				"roleInUseDetails": "The role <@&{{roleId}}> is currently assigned to {{memberCount}} members on this Discord server. If you continue, the bot will regularly remove every user from this role unless they are verified and have fulfilled the token ownership requirements you are configuring.\n\nPlease confirm, if you want to proceed regardless.\n\n💡 Do NOT make token role assignments with roles that are assigned by other bots. The bots will \"battle\" to assign and unassign, otherwise.",
				"confirmRole": "I understand - continue",
				"canceled": "ℹ Adding the following token role was cancelled:\n\nRole <@&{{roleId}}>\nPolicy ID: {{policyId}}\nMinimum token amount: {{minimumTokenQuantity}}"
			},
			"remove": {
				"success": "🗑️ Removed the following token role auto-assignment from this server:",
				"errorNotFound": "⚠ No token role with the ID **{{tokenRoleId}}** was found for this server. Nothing was removed."
			}
		},
		"delegatorroles": {
			"list": {
				"purpose": "This is the list of Discord roles that will be automatically assigned, based on delegated ADA amounts and stakepools for verified users.",
				"noDelegatorRolesTitle": "No delegator roles",
				"noDelegatorRolesDetail": "*Currently, this server has no delegation-based roles configured.*",
				"stakepoolNameOfficial": "Stakepool {{{officialStakepool.info.ticker}}}, {{officialStakepool.poolHash}} (Role-ID: {{delegatorRole.id}})",
				"stakepoolNameAny": "Any official stakepool of this server (see list via /info) (Role-ID: {{delegatorRole.id}})",
				"stakepoolNameInofficial": "{{delegatorRole.poolHash}} (Role-ID: {{delegatorRole.id}})",
				"delegatorRoleDetails": "All verified users that delegate at least **₳{{minimumStake}}** to the above pool will be assigned the role <@&{{delegatorRole.roleId}}>."
			},
			"add": {
				"success": "✅ New automatic role-assignment for the following delegators added to this server:",
				"errorMinimumStake": "⚠ Automatic delegator role-assignment could not be added, as minimum stake amount needs to be at least 1₳.",
				"roleInUseWarning": "⚠ WARNING - ROLE IN USE",
				"roleInUseDetails": "The role <@&{{roleId}}> is currently assigned to {{memberCount}} members on this Discord server. If you continue, the bot will regularly remove every user from this role unless they are verified and have fulfilled the delegation requirements you are configuring.\n\nPlease confirm, if you want to proceed regardless.\n\n💡 Do NOT make delegator role assignments with roles that are assigned by other bots. The bots will \"battle\" to assign and unassign, otherwise.",
				"confirmRole": "I understand - continue",
				"canceled": "ℹ Adding the following delegator role was cancelled:\n\nRole <@&{{roleId}}>\nPool hash: {{poolHash}}\nMinimum staked ADA: {{minimumStakeAda}}"
			},
			"remove": {
				"success": "🗑️ Removed the following delegator role auto-assignment from this server:",
				"errorNotFound": "⚠ No delegator role with the ID **{{delegatorRoleId}}** was found for this server. Nothing was removed."
			}
		},
		"poll": {
			"list": {
				"purpose": "This is the list of all existing polls for this Discord server.",
				"noPollsDetail": "*There are no configured polls on this server.*",
				"pollInfo": "Opens on: {{openAfterFormatted}} UTC\nCloses on: {{openUntilFormatted}} UTC",
				"choosePollDetails": "Choose the poll you want more details on",
				"details": "Poll Details",
				"detailsName": "Display name (Internal name)",
				"detailsDescription": "Description/Question",
				"detailsCreation": "Created at",
				"creationDate": "{{createTime}} UTC",
				"detailsDates": "Opens/Closes",
				"detailsChoices": "Poll voting choices",
				"detailsConfiguration": "Poll configuration",
				"optionList": "Public results: {{resultsVisible}}\nMultiple options allowed: {{multipleVotes}}\nToken-based vote: {{tokenBased}}\nWeighted vote: {{weighted}}",
				"detailsRoles": "User has to have one of the following roles",
				"requiredRoleEntry": "• <@&{{role.roleId}}>",
				"detailsChannel": "Announcement info",
				"announcementNone": "No voting announcement will be made by the bot and the results will not be automatically published when the vote ends.",
				"announcementChannel": "A voting announcement with info on how to vote will be posted in <#{{poll.channelId}}> when the poll opens. When the poll closes, the results will be published in the same channel.",
				"adminName": "{{poll.displayName}} ({{poll.name}})"
			},
			"add": {
				"previewPhase1": "Welcome to the new poll wizard 🧙‍♂️! We will walk you through creating a new poll for your server.\n⚠ We highly suggest only running this command in a private channel as you will be asked to type messages to populate the description and voting options later on.\n\nYou've configured the following initial settings for your poll:",
				"previewPhase1Details": "**Internal name**: {{name}}\n**Display name**: {{displayName}}\n**Poll open time**: Users will be able to start voting at {{pollOpenTime}} UTC\n**Poll close time**: Users can vote until {{pollCloseTime}} UTC",
				"previewPhase1NoChannel": "You have not selected a channel for the bot to post a voting announcement in at poll open time.",
				"previewPhase1Channel": "The bot will post a voting announcement in <#{{publishChannel}}> once the poll opens.",
				"previewPhase1NoRequiredRole": "No role requirements are in effect - everybody will be able to see the poll.",
				"previewPhase1RequiredRole": "To view and participate in the vote, users will need to be assigned the <@&{{requiredRole}}> role. You can additional roles via the */configure-poll manage* command later.",
				"previewPhase1NextSteps": "❗ Please send a message to this current channel (<#{{currentChannel}}>) in the next 5 minutes, containing the description for you poll that you would like to use:",
				"startPhase3": "Use this description",
				"redoPhase2": "Change description",
				"previewPhase2Description": "**Poll Description/Question**:\n{{{description}}}",
				"previewPhase3NextSteps": "❗ Please send up to ten messages to this current channel (<#{{currentChannel}}>) containing your voting options and add a reaction with your desired emote to each message:",
				"previewPhase3Options": "**Vote options**:\n{{{options}}}",
				"startPhase4": "Use these options",
				"redoPhase3": "Reset all options",
				"previewPhase4NextSteps": "❗ Please select some final settings for your poll. If you choose token ownership to be required, a final step will ask you for information about the voting snapshot",
				"isPublicVote": "Are results publicly viewable before the vote ends?",
				"publicVoteYes": "Public Vote",
				"publicVoteYesDescription": "Voting results are publicly visible via /vote",
				"publicVoteNo": "Hidden Results",
				"publicVoteNoDescription": "Voting results are hidden until manually published",
				"isMultipleVotes": "Can users vote for more than one option at once?",
				"multipleVoteYes": "Multiple votes",
				"multipleVoteYesDescription": "Users can select multiple voting options",
				"multipleVoteNo": "One Choice",
				"multipleVoteNoDescription": "Users can only select one choice",
				"isTokenOwnershipRequired": "Can only token holders vote in this poll?",
				"tokenTypeNone": "Everyone",
				"tokenTypeHolderOnly": "Holders",
				"tokenTypeHolderWeighted": "Weighted",
				"tokenTypeNoneDescription": "No, anyone can",
				"tokenTypeHolderOnlyDescription": "Yes, each holder gets one vote",
				"tokenTypeHolderWeightedDescription": "Yes, holders get votes based on owned number of tokens",
				"startPhase5": "Provide token details",
				"previewPhase5NextStepsPolicyIdOnly": "Only people that are verified owners of tokens from the policy *{{policyId}}* can vote.",
				"previewPhase5NextStepsPolicyIdAndFingerprint": "Only people that are verified owners of tokens from the policy *{{policyId}}* with the asset fingerprint *{{assetFingerprint}}* can vote.\n⚠ The ownership snapshot will be made in the next ten minutes after this poll is created.",
				"previewPhase5NextStepsWeighted": "The voting power will be based on the amount of tokens. If multiple selections can be made, the total voting power will be evenly distributed across all choices (rounded down).",
				"previewPhase5NextSteps": "❗ Please enter the policy ID of the token that voters will be voting with. If using fungible tokens, we also recommend to provide the asset fingerprint, separated with a plus from the policy ID, as follows: *489aa3378d13c87ad4e595ab2a9092e9c92bd645b725b853a3cdebf3+asset1acqu7skxpaj2k5kgnvpk96yclag4nfw48zkpek*",
				"redoPhase5": "Change token data",
				"finish": "Create poll",
				"success": "✅ New poll with the following settings added to this server:",
				"errorTimeout": "The poll wizard 🧙‍♂️ timed out waiting for your input, sorry. Please restart the wizard via the */configure-poll add* command.",
				"errorPolicyFormat": "The format of either the policy ID, the asset fingerprint, or both are incorrect.\nValid policy IDs have 56 alphanumberic characters.\nAsset fingerprints look as follows: *asset1acqu7skxpaj2k5kgnvpk96yclag4nfw48zkpek*",
				"invalidName": "⚠ Could not add poll because the name \"{{pollName}}\" was invalid. While the display name can be any text, the internal name needs to be start with a letter and can only contain letters and numbers, no whitespaces or special characters, and 30 characters or less."
			},
			"remove": {
				"success": "🗑️ Removed the following poll from this server:",
				"purpose": "Select the poll to remove from your Discord server.\n\n⚠ **ALL REGISTERED VOTES WILL BE REMOVED AND BECOME INACCESSIBLE FOR YOU, IF YOU REMOVE THE POLL**.\n\nOnly do this after you have processed this poll.",
				"errorNotFound": "⚠ No poll with the ID **{{pollId}}** was found for this server. Nothing was removed.",
				"choosePollDetails": "Choose the poll you want to irrevocably delete"
			}
		},
		"whitelist": {
			"list": {
				"purpose": "This is the list of all existing whitelists for this Discord server.",
				"noWhitelistsDetail": "*There are no configured whitelists on this server.*",
				"adminName": "{{{whitelist.displayName}}} ({{whitelist.name}})"
			},
			"add": {
				"success": "✅ New whitelist with the following requirements added to this server:",
				"alreadyExists": "⚠ A whitelist with the name \"{{whitelistName}}\" already exists. Please choose a different internal name.",
				"invalidName": "⚠ Could not add whitelist because the name \"{{whitelistName}}\" was invalid. While the display name can be any text, the internal name needs to be start with a letter and can only contain letters and numbers, no whitespaces or special characters, and 30 characters or less."
			},
			"close": {
				"purpose": "Close registrations for this whitelist, either permanently or temporarily. You can close lists before they reach their end times or max user counts with this command. You can reopen it later via */configure-whitelist open*.",
				"success": "🔒 The whitelist {{whitelist.displayName}} ({{whitelist.name}}) was successfully closed! If you want to reopen it later, use */configure-whitelist open*.",
				"noWhitelistsDetail": "⚠ There are currently no open whitelists on this server that can be closed."
			},
			"open": {
				"purpose": "Reopen registrations for this whitelist. Users will be able to register if the signup window has not yet closed and they fulfill all other conditions.",
				"success": "🔓 The whitelist {{whitelist.displayName}} ({{whitelist.name}}) was successfully reopened! If you want to close it again later, use */configure-whitelist close*.",
				"noWhitelistsDetail": "⚠ There are currently no closed whitelists on this server that can be opened."
			},
			"remove": {
				"success": "🗑️ Removed the following whitelist from this server:",
				"purpose": "Select the whitelist to remove from your Discord server.\n\n⚠ **ALL REGISTERED ADDRESSES WILL BE REMOVED AND BECOME INACCESSIBLE FOR YOU, IF YOU REMOVE THE WHITELIST**.\n\nOnly do this after you have processed this whitelist for minting/distribution etc.",
				"errorNotFound": "⚠ No whitelist with the name **{{whitelistName}}** was found for this server. Nothing was removed."
			}
		},
		"adminaccess": {
			"list": {
				"purpose": "This is the list of all current roles that have bot administrator status on this Discord server:",
				"administratorTitle": "Active administrator roles",
				"administratorEntry": "• <@&{{roleId}}>"
			},
			"add": {
				"success": "✅ The role <@&{{roleId}}> was successfully added as a new administrator role. The users with this role should be able to access the adminstrator commands immediately.",
				"alreadyExists": "⚠ The role <@&{{roleId}}> is already an administrator and was not added again.",
				"purpose": "configure.adminaccess.add.purpose"
			},
			"remove": {
				"success": "🗑️ Removed the administrative role <@&{{roleId}}> from this Discord server. The following roles remain administrators:",
				"notExists": "⚠ The role <@&{{roleId}}> is currently not an administrator role and was not removed.",
				"cannotRemoveLastAdminRole": "⚠ You cannot remove this administrator role because it would remove your own administrative access."
			}
		},
		"useraccess": {
			"list": {
				"purpose": "This is the list of all current roles that have basic bot usage permissions on this Discord server:",
				"userTitle": "Active user roles",
				"userEntry": "• <@&{{roleId}}>"
			},
			"add": {
				"success": "✅ The role <@&{{roleId}}> was successfully added as a new user role. The users with this role should be able to verify and access basic commands immediately.",
				"alreadyExists": "⚠ The role <@&{{roleId}}> is already an allowed user on this Discord server and was not added again."
			},
			"remove": {
				"success": "🗑️ Removed the user role <@&{{roleId}}> from this Discord server. The following roles remain users:",
				"notExists": "⚠ The role <@&{{roleId}}> is currently not a user role and was not removed.",
				"cannotRemoveLastUserRole": "⚠ The role <@&{{roleId}}> is the last user role on this server and cannot be removed."
			}
		},
		"settings": {
			"features": {
				"purpose": "Change the currently enabled feature set for the bot on this Discord server.",
				"chooseFeatures": "Choose all features you want to continue by using the below selection list:",
				"saveSettings": "Save Settings",
				"success": "✅ Your feature changes have been successfully applied! It may take a few minutes for the commands to become available."
			}
		},
		"api": {
			"generatetoken": {
				"success": "✅ A new access token was generated. Please write down this token to provide to your development team.\n❗ You will not be able to access this token again. The only way to view an access token is by generating a new one.\n\n**Your token:**\n\n*{{accessToken}}*\n\nFind the REST API documentation by downloading the current OpenAPI Swagger Documentation at the following URL: {{{externalDocumentationUrl}}}"
			},
			"removetoken": {
				"success": "🗑️ The API access token for this Discord server was successfully removed.\n❗ Any and all REST API integrations your project is using will currently not be able to retrieve data from HAZELnet."
			}
		},
		"premium": {
			"stake": {
				"purpose": "Configure your stake address that will be used to ensure your Discord server has Black Edition enabled. Find out what the current required stake amount based on membership is and update your stake information if needed."
			}
		}
	},
	"start": {
		"welcomeTitle": "Welcome to HAZELnet!",
		"completeTitle": "Great work!",
		"configureMessage": "The /start command will help you set up your HAZELnet bot. Select your options below:",
		"configureLanguageTitle": "Language",
		"configureAdminRoleTitle": "Admin Role",
		"configureUserRoleTitle": "User Role",
		"configureFeaturesTitle": "Features",
		"configureLanguageText": "This setting determines the language of all bot commands and interactions. Currently it is not possible to have commands translate on a per-user basis - bot replies will in the future be able to be based on a user-selected language.",
		"configureAdminRoleText": "All users with the admin role will be able to configure the bot. Admins can set official stakepools, policies and automatic role-assignments. Expose these abilities to as few people as possible. The guild owner will always have access to all commands, regardless of this setting. You can add additional roles using the /configure-command later. If you have more than 25 roles, only your first 25 will be shown here. Use the */configure-adminaccess* command to adjust this later.",
		"configureUserRoleText": "The users in this role will be able to verify their wallets and access basic information about this server's stakepools, NFT policies etc. You can add additional roles using the /configure-command later. If you have more than 25 roles, only your first 25 will be shown here. Use the */configure-useraccess* command to adjust this later.",
		"configureFeaturesText": "The features that you enable will determine which commands are available to users and administrators. Depending on which features you turn on, you will have different capabilities available.",
		"chooseLanguage": "Choose your bot language",
		"chooseAdminRole": "Choose your admin role",
		"chooseUserRole": "Choose your user role",
		"chooseFeatures": "Choose the features you want to use",
		"selectedLanguage": "Your selected language is **{{language}}**.",
		"selectedAdminRoles": "The users with the following roles will be able to configure the bot:",
		"selectedUserRoles": "The users with the following roles will be able to verify their wallets and interact with the bot:",
		"selectedFeatures": "You have selected the following features:\n\n{{{selectedFeatureList}}}",
		"selectedFeatureItem": "• **{{{feature}}}**",
		"finishSetupButton": "Finish setup",
		"resetSetupButton": "Reset settings",
		"setupRoleWarningMessage": "Thank you 😻\n\n**Your setup is complete with warnings**:\n\n❗ Please be aware the bot did not find all the necessary permissions through roles assigned to it. Make sure the bot has one or multiple roles that grant at least the following permissions: Send Messages, Read Messages, Manage Messages, Manage Roles\n\n💡 Make sure the bot role is high enough in the Discord role list, so it can assign any auto-assign roles it is configured to manage.",
		"setupCompleteMessage": "Thank you 😻\n\n**Your setup is complete!**\n\n💡 Make sure the bot role is high enough so it can assign any auto-assign roles it is configured to manage."
	},
	"features": {
		"stakepoolTitle": "Stakepools",
		"stakepool": "Stakepool features (official pools, delegator roles)",
		"tokenTitle": "Tokens",
		"token": "Fungible tokens and NFTs (official policies, token roles)",
		"whitelistTitle": "Whitelists",
		"whitelist": "Self-service address whitelists with requirements",
		"pollTitle": "Polls",
		"poll": "Polls and voting system for open and holder-limited polls",
		"claimphysicalTitle": "Physical Item Claiming",
		"claimphysical": "Claiming physical items via verified lists",
		"cardolphins": "features.cardolphins"
	},
	"generic": {
		"cancel": "Cancel",
		"yes": "Yes",
		"no": "No",
		"clickhelp": "Click for help",
		"advertisement": "Advertisement"
	},
	"languages": {
		"en": "English",
		"de": "German"
	},
	"errors": {
		"notYetImplemented": "Not yet implemented. Please be patient with us.",
		"permissionDeniedTitle": "Permission Denied",
		"permissionDeniedInformation": "⛔ You do not have permission to access this information.",
		"permissionDeniedChanges": "⛔ You do not have permission to make these changes.",
		"notWhitelisted": "Thank you for your interest in HAZELnet. Unfortunately, your server is not on the early access list. Contact @NilsCodes on Twitter to see if you can participate in the beta program.",
		"invalidIsoDateFormat": "Invalid date format value \"{{value}}\" for parameter \"{{parameter}}\" - the format needs to be yyyy-MM-ddTHH:mm:ssZ (for example 2022-01-31T15:00:00Z)"
	},
	"about": {
		"title": "About HAZELnet",
		"info": "The HAZELnet Discord Community System was proudly built by the operators of HAZEL stakepool. We appreciate all our delegators and would love your support on our mission to improve feline lives.\n\nIf you would like this Discord bot in your server for free, visit https://www.hazelnet.io or https://twitter.com/HAZELnet_io",
		"twitter": {
			"author": "@NilsCodes on Twitter",
			"bot": "@HAZELnet_io on Twitter"
		}
	}
}